class KAppTexts {
  /// Dashboard screen small card titles
  static const String munqibat = 'منقبت';
  static const String izhar_tashhakor = 'اظہار تشکر';
  static const String muqadima_kitab = 'مقدمہ الکتاب';
  static const String paysh_alfaz = 'پیش لفظ';
  static const String hawasheHawala = 'حواشی و حوالہ جات';
  static const String qataeTarekh = 'قطعہ تاریخ وصال';
  static const String appName = 'قلبِ سلیم';

  static const String munqabatAuther =
      'حضرت سّید محمد ظفر مشہدی قادری رحمة اهلل عليه';
  static const String izharTashkorAuther = 'سید محمد فراز شاہ عفی عنہ';
  static const String muqadimaAlkitabAuther =
      'فقیر الی اهلل ابو الحقائق پیر سّید امانت علی شاہ چشتی نظامی';

  static const String pesheLafazAuther = 'عبد الحمید قادری عفی عنہ';
  static const String aqwalOIrshadatAuther = 'مشہدی قادری رحمة الله تعالى عليه';

  /// Dashboard screen small card titles and subtitles
  static const String lCardTitle1 = 'سوانح حیات';
  static const String reshahatQalam = 'از رشحاتِ قلم:';
  static const String lCardTitle2 = 'قلبِ سلیم';
  static const String lCardTitle3 = 'اقوال و ارشاداِت عالیہ';
  static const String lCardSubTitle3 =
      'امام الاولیاء حضرت پیر سیّد محمّد عبد  الله  شاہ';
  static const String lCardTitle4 = 'الفراق';

  /// Shajerai Qadiria Nasebia
  static const String prophetMuhammad =
      'خاتم النبّیین حضرت سّیدنا محمد رسول الله صلی الله عليه وآله وسلم';

  static const String fatimaAndAli =
      'ِن جنت حضرت سّیدہ فاطمۃ الزہراء رضي الله عنها مع مشکل کشاحضرت سّیدنا مولٰی علی المرتضٰی کّرم الله تعالى';

  static const String imamHussain =
      'امام عالی مقام سّید الشہداء حضرت سّیدنا امام حسین رضي اهلل تعالى عنه';

  static const String imamAliZainulAbidin =
      'حضرت سّیدنا امام علی زین العابدین رضي اهلل تعالى عنه';

  static const String imamMuhammadBaqir =
      'حضرت سّیدنا امام محّمد باقر رضي اهلل تعالى عنه';

  static const String imamJafarSadiq =
      'حضرت سّیدنا امام جعفر الصادق رضي اهلل تعالى عنه';

  static const String imamMusaKazim =
      'حضرت سّیدنا امام موسٰی کاظم رضي اهلل تعالى عنه';

  static const String sayyedIshaq =
      'حضرت سّید اسحاق االمیر الموافق رحمة اهلل تعالى عليه';

  static const String sayyedAbuAbdullah =
      'حضرت سّیدابو عبد اهلل محّمد اّول رحمة اهلل تعالى عليه';

  static const String sayyedAbuAlQasim =
      'حضرت سّید ابو القاسم عبد اهلل رحمة اهلل تعالى عليه';

  static const String sayyedAbuAlHusayn =
      'حضرت سّید ابو الحسین محّمد عالم رحمة اهلل تعالى عليه';

  static const String sayyedAbuAlHasan =
      'حضرت سّید ابو الحسن موسٰی الزاہد رحمة اهلل تعالى عليه';

  static const String sayyedIshaqThani =
      'حضرت سّید اسحاق ثانی رحمة اهلل تعالى عليه';

  static const String sayyedSultanAbdulRahman =
      'رئیس الزماں حضرت سّید سلطان عبد الرحٰم';

  static const String sayyedAliAlAmeer =
      'حضرت سّید علی االمیر رحمة اهلل تعالى عليه';

  static const String sayyedSultanAbuAlQasim =
      'حضرت سّید سلطان ابو القاسم حسین الموسوی المشہدی رحمة اهلل تعالى عليه';

  static const String sayyedSultanMuhammadAhmad =
      'حضرت سّید سلطان محّمد احمد سابق مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedSultanSadruddin =
      'حضرت سّید سلطان صدر الدین مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedRazauddin =
      'حضرت سّید رضاء الدین مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedMuhammadThani =
      'حضرت سّید محّمد ثانی الغازی مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedMuhammadWaliuddin =
      'حضرت سّید محّمد ولی الدین مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedWajihuddin =
      'حضرت سّید وجیہ الدین مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedShahAbdulKarim =
      'حضرت سّید شاہ عبد الکریم مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedShahAliSheer =
      'حضرت سّید شاہ علی شیر مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedShahNasiruddin =
      'حضرت سّید شاہ نصیر الدین مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedShahZainulAbidin =
      'حضرت سّید شاہ زین العابدین مشہدی المعروف شاہ زین سرکار رحمة اهلل تعالى عليه';

  static const String sayyedMuhammadShah =
      'حضرت سّید محّمد شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedIbrahimShah =
      'حضرت سّید ابراہیم شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedMusaShah =
      'حضرت سّید موسٰی مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedRajanShah =
      'حضرت سّید راجن شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedShahNawazShah =
      'حضرت سّید شاہ نواز شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedMuhammadZamanShah =
      'حضرت سّید محّمد زمان شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedQadirBakhshShah =
      'حضرت سّید قادر بخش شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedHaiderShah =
      'حضرت سّید حیدر شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedDolatShah =
      'حضرت سّید دولت شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedKhidrHayatShah =
      'حضرت سّید خضر حیات شاہ مشہدی رحمة اهلل تعالى عليه';

  static const String sayyedMuhammadAbdullahShah =
      'حضرت سّید محّمد عبد اهلل شاہ مشہدی قادری رحمة اهلل تعالى عليه';

  /// Dashboard screen bottom container strings
  static const String copyRight = "© 2021";
  static const String senFirst =
      " جملہ حقوق بحقِ ناشر محفوظ ہیں  \nادارہ تحقیقاتِ نوا";
  static const String senSecond = """مکتبہ حزب الرحمٰن
    آستانہ عالیہ قادریہ
    حضرت پیر سید محمد عبدالله شاہ مشہدی قادری
    رحمة الله تعالى عليه
    """;
  static const String sentThird = """
    موضع قادر بخش شریف، تحصیل کمالیہ
    ضلع ٹوبہ ٹیک سنگھ، پاکستان
    """;

  /// shajra hasebiya

  static const String treeOfQadriya = 'شجرٔہ قادریہ حسبیہ';
  static const String shajraQadriya = 'شجرٔہ قادریہ';

  static const String introduction =
      'آپ رحمة اهلل عليه کا شجرٔہ حسب اکتالیس (41) واسطوں سے پیارے آقا ومولٰی، محبوب خدا، حضرت سّیدنا احمد مجتبٰی محمد مصطفٰی صلی الله عليه وآله وسلم سے جا ملتا ہے۔ اس کی پوری تفصیل مالحظہ فرمائیے';

  static const String imamAli =
      'حضرت سّیدنا علی المرتضٰی کّرم الله تعالى وجہہ الکریم';

  static const String imamAliReza =
      'حضرت سّیدنا امام علی رضا رضي اهلل تعالى عنه';

  static const String sheikhMarufKarkhi =
      'حضرت شیخ معروف کرخی رحمة اهلل تعالى عليه';

  static const String sheikhSariSaqati =
      'حضرت شیخ سری سقطی رحمة اهلل تعالى عليه';

  static const String sheikhJunaidBaghdadi =
      'حضرت شیخ جنید بغدادی رحمة اهلل تعالى عليه';

  static const String sheikhAbuBakrShibli =
      'حضرت شیخ ابوبکر شبلی رحمة اهلل تعالى عليه';

  static const String sheikhAbuFadlAbdulWahid =
      'حضرت شیخ ابو الفضل عبد الواحد رحمة اهلل تعالى عليه';

  static const String sheikhAbuFarahTartusi =
      'حضرت شیخ ابو الفرح طرطوسی رحمة اهلل تعالى عليه';

  static const String sheikhAbuHassanHankari =
      'حضرت شیخ ابو الحسن الہنکاری رحمة اهلل تعالى عليه';

  static const String sheikhAbuSaeedMubarak =
      'حضرت شیخ ابو سعید مبارک مخزومی رحمة اهلل تعالى عليه';

  static const String abdulQadirJilani =
      'حضرت سّیدنا عبدا لقادر جیالنی محبوِب سبحانی رحمة اهلل تعالى عليه';

  static const String sayyedAbdulWahab =
      'حضرت سّید عبد الوہاب رحمة اهلل تعالى عليه';

  static const String sayyedFadlAllah =
      'حضرت سّید فضل اللہ رحمة اهلل تعالى عليه';

  static const String sayyedAbuFarahSufi =
      'حضرت سّید ابو الفرح صوفی رحمة اهلل تعالى عليه';

  static const String sayyedGanjBakhsh =
      'حضرت سّید گنج بخش رحمة اهلل تعالى عليه';

  static const String sayyedAhmad = 'حضرت سّید احمد رحمة اهلل تعالى عليه';

  static const String sayyedMasood = 'حضرت سّید مسعود رحمة اهلل تعالى عليه';

  static const String sayyedNooruddinAli =
      'حضرت سّید نور الدین علی رحمة اهلل تعالى عليه';

  static const String sayyedShahMir = 'حضرت سّید شاہ میر رحمة اهلل تعالى عليه';

  static const String sheikhShamsuddinMuhammad =
      'حضرت شیخ شمس الدین محمد رحمة اهلل تعالى عليه';

  static const String sayyedMuhammadGhous =
      'حضرت سّید محمد غوث گیالنی رحمة اهلل تعالى عليه';

  static const String sayyedAbdulQadirSani =
      'حضرت سّید عبدالقادر ثانی رحمة اهلل تعالى عليه';

  static const String sheikhMuhammadBalPir =
      'حضرت شیخ محمد باال پیر رحمة اهلل تعالى عليه';

  static const String sayyedAbdulQadirThalith =
      'حضرت سّید عبد القادر ثالث رحمة اهلل تعالى عليه';

  static const String sayyedZainulAbidin =
      'حضرت سّید زین العابدین رحمة اهلل تعالى عليه';

  static const String sayyedAbdulRazzaq =
      'حضرت سّید عبد الرزاق رحمة اهلل تعالى عليه';

  static const String sayyedMustafa = 'حضرت سّید مصطفٰی رحمة اهلل تعالى عليه';

  static const String sayyedMahmoodJilani =
      'حضرت سّید محمود جیالنی رحمة اهلل تعالى عليه';

  static const String sayyedMujtaba =
      'حضرت سّید مجتبٰی المعروف چراغ شاہ رحمة اهلل تعالى عليه';

  static const String sayyedHaiderBakhsh =
      'حضرت سّید حیدر بخش رحمة اهلل تعالى عليه';

  static const String sayyedGhulamGhous =
      'حضرت سّید غالم غوث گیالنی رحمة اهلل تعالى عليه';

  static const String sayyedAmanullah =
      'حضرت سّید امان اللہ المعروف سلطان ہاتھیوان رحمة اهلل تعالى عليه';

  static const String sayyedAliSheer = 'حضرت سّید علی شیر رحمة اهلل تعالى عليه';

  static const String sayyedChiraghAliShah =
      'حضرت سّید چراغ علی شاہ رحمة اهلل تعالى عليه';

  static const String sayyedPirQutubAliShah =
      'حضرت پیر سّید قطب علی شاہ رحمة اهلل تعالى عليه';

  static const String sayyedPirMuhammadAbdullahShah =
      'حضرت پیر سّید محمد عبد اللہ شاہ مشہدی قادری رحمة اهلل تعالى عليه';

  /// Long content texts
  static const String qathaTarekh = '''
از حضرت ابو الحقائق پیر سّید امانت علی شاہ چشتی نظامی الہوری رحمة اهلل عليه
کمال و کامل و اکمل ولی و سّر اللہ
ِن وجہ اللہ
شا
ِخ
ِر حق، ر
جماِل مظہ
ِن غیب نظامؔی بگفت در وصلش
لسا
ِر خلِد بریں سّید محّمد عبد اللہ
بہا
ہجری المقدس ۱۳۸۱
''';
  static const String bottomMunqibatLongText = '''
  منقبت
آرزو کہ شدی از نظرنہاں
ِن
اے جا

ِر جاں ناتواں

یک دم ربودٔہ صب

دیں
ِع
اے آفتاِب ملِک سعادت متا

ِن جاں
اے خسرو، یگانہ و سلطان و جا
اے جرعہ نوش بادٔہ مازاغ البصر
ِر المکاں
انوا
ِر
باال بلند و مظہ

کائنات
ِع
روشن شد از نگاِہ تو اوضا
پیدا شد از لطافِت تو زینِت جہاں
!اے سّید محّمد عبداللہ مرحبا
ِن جاں
ِن جہان و جہا

صد مرحبا! اے جا

دل
ِم
ِن حری
روا
ِح
صد مرحبا! اے رو

ِر المکاں
صد مرحبا! اے کاشِف اسرا
اے شاہ! المدد کہ غمت صبر و ہوش برد
ِر جاں
اے خضر! االماں کہ نماند ہم قرا
اے صاحِب کمال وے صورِت جمال
کّر و بیاں
ِن
ذکرت خوشا کہ ورِد زبا
در ہر زماں بلطف و عنایت کشودہ اند
از ہ ِتّم بلند تو صد کارہائے جاں
عمر عزیز گرچہ بعصیاں گزاشتیم
لیکن سپردہ ام بنگاِہ تو قلب و جاں
اکنوں ز من بپرس کہ ایں حاِل زار چیست
زاں پیشتر کہ مغز نماند در استخواں
یک نگِہ کرم کہ دعا گوئے دولتم
جاں قرار بگیرد بملک جاں
ِغ
تا مر
در مدحِت توقادری تنہا نبرد راہ
در دیر بود گریہ و بر فلک داستاں

دولت
ِر
گدائے د

ٗہ
عبد الحمید قادری غفر ل
  
  ''';

  static const String sawanehHayatLongText = '''
امام االولیاء حضرت پیر سّید محّمد عبد اللہ شاہ مشہدی قادری رحمة اهلل عليه
از رشحاِت قلم: حضرت سّید محمد ظفر قادری رحمة اهلل عليه

ِر
انوا
ِع
سبحانی، منب
ِم
ِز طریقت، مخز ِن علو

شریعت، شہبا
ِم
سلطان االولیاء، زبدۃ االصفیاء، امام العارفین، سّید العاشقین، اما

معنوی، قبلٔہ دل و کعبٔہ جان، حضرت پیر سّید محمد عبد اهلل شاہ صاحب مشہدی قادری رحمة اهلل عليه
ِر
یزدانی، واقِف اسرا
1898ء بمطابق ۱۳۱۵ ھ کو اس جہان پر تشریف الئے۔ آپ کے آباؤ اجداد راولپنڈی کے عالقے سے نقل وطن کرکے یہاں رونق
افروز ہوئے۔ یہ حکایت یوں بیان کی جاتی ہے کہ حضرت امام لطیف بری رحمة اهلل عليه کے خاندان سے سّید محمد موسٰی رحمة اهلل
عليه راولپنڈی سے عالقہ کمالیہ ضلع الئل پور پہنچے۔ اورجس جگہ پر آپ نے قیام فرمایا، وہاں ایک بستی آباد ہوئی جو بعد میں
گرامی سّید قادر بخش تھا، دو بھائی تھے یعنی ایک
ِم
حضرت ہی کے نام سے مشہور ہوئی۔ پھر جناب شیخ کے جّدِ امجد جن کا اس
بھائی سّید قادر بخش رحمة اهلل عليه اور دوسرا سّید عظمت شاہ رحمة اهلل عليه۔ ان دونوں صاحبان نے ایک دوسرے کے قریب قریب
اپنی اپنی جائے رہائش بنائی جو بڑھتے بڑھتے گاؤں کی شکل اختیار کرگئے، ان دونوں کے درمیان صرف ایک میل کا فاصلہ ہے۔
گاؤں انہی بھائیوں کے نام پر یعنی عظمت شاہ اور قادر بخش کے نام سے مشہور ہیں۔
قبلہ و کعبہ ہادی راہنما کی پیدائش بھی اسی جگہ ہوئی۔ کتنی مبارک ہے وہ جگہ جہاں خدا تعالٰی کے قاصد، انبیاء اور
اولیاء تشریف فرماہوں۔ مدینہ منورہ جہاں میرے محبوب محّمد پاک صلی الله عليه وآله وسلم رونق افروز ہوئے، ہمارے لیے عرِش
کائنات صلی الله عليه وآله وسلم کے پیارے اور چاہنے
ِر
عظیم کی حیثیت رکھتا ہے۔ اور پھر جس جگہ اس محبوِب حق یعنی سرو

انصاف دیکھا

حقیقی کے پروانے ہوں تو کیا اس مقام کی قدر و منزلت کچھ کم ہوگی؟ نہیں بلکہ اگر بنظ ِر
ِع
والے ہوں اور اس شم
جائے تو بھٹکے ہوئے مسافروں کی منزل اور تکیہ گاِہ عاجزاں ہے۔ جناب کی پیدائش کے وقت آپ کے والدین نہایت تنگی و عسرت
میں گزر اوقات کر رہے تھے اور خود حضور نے بھی اپنی عمر کا کافی حصہ اسی حالت میں گزارا۔ کون جانتا تھا کہ اس
گدڑی سے بھی لعل نکلے گا؟ کسے خبر تھی کہ اس گھر میں جہاں مفلسی اپنے قدم جمائے ہوئے تھی، ایک ماِہ نورانی چمکے گا
جو اپنے نور کی خنک روشنی سے ظلمِت جہل کو ایک نیا اجاال بخشے گا۔ آج سے چودہ سو برس پہلے جو حالت عرب کی تھی،
وہی حالت جناب کے زمانہ میں اس عالقہ میں تھی، یعنی لوگ تو مسلمان تھے لیکن یہ نہیں جانتے تھے کہ اسالم کس چیز کا نام
ہے؟ ہندو قوم کے ساتھ رہتے رہتے ہندو تہذیب ِان میں کوٹ کوٹ کر بھری ہوئی تھی۔ بالکل انہی کا تاثر لے چکے تھے اور انہی کے
توہمات و رواج مسلمانوں نے اپنائے ہوئے تھے، بلکہ نوبت یہاں تک پہنچ چکی تھی کہ ہندوؤں کے کہنے پر مرِض چیچک کو دور
کرنے کے لیے درختوں کی پرستش کرتے تھے۔ یہ اس عالقہ کی حالت تھی جہاں اعلٰی حضرت سّید محمد عبد اهلل شاہ صاحب
رحمة اهلل عليه نے قدم رنجہ فرمایا۔
سّنت اٰلہیہ ہے کہ جب کوئی قوم حد سے بڑھ جاتی ہے یعنی بہت زیادہ گمراہ ہوجاتی ہے تو ہم اپنا قاصد بھیج دیتے ہیں تا
ِق خدا کو اسی کی راہ پر گامزن کردے، اور انہیں بح ِر ظلمات سے ساحِل رحمت کی طرف کھینچ الئے۔

کہ وہ مخلو
خدائے بلند و باال نے جب ان لوگوں کو حدوِد شرعیہ کو پھالنگتے دیکھا تو اپنے کرم سے یہ آفتاب طلوع فرمایا جس نے ہر
زن و مرد کے خانٔہ دل کو اپنی نورانی شعاعوں سے منور کرکے اللہ تعالٰی کی راہ پر ڈال دیا۔
ا۔ )8(
َباِطَل َكاَن َزُهْوًق
ْل
ۭ ِاَّن ا
َباِط ُل
ْل
َحُّق َوَزَهَق ا
ْل
َجۗاَء ا
َوُق ْل

’’اور ) اے حبیبصلى الله عليه وسلم ! ( آپ فرما دیجیے حق آگیا اور باطل مٹ گیا، بے شک باطل ) کہیں بھی ہو، آخر ( مٹنے واال ہی ہے ۔ ‘‘
آپ جب کچھ بڑے ہوئے تو پرانے دستور کے مطابق مسجد ہی سے اپنی تعلیم کا آغاز کیا۔ یہ وہ زمانہ تھا جب کہ پورے ضلع
میں صرف چند اسکول تھے، اور وہ بھی بڑے بڑے شہروں میں۔ دیہاتی لوگوں کو تو پتہ ہی نہ تھا کہ اسکول بھی کوئی چیز

کریم اور دوسری چھوٹی
ِن
ہے۔ بہر حال آپ نے وہیں مسجد میں ایک دیندار مولوی صاحب سے سلسلٔہ تعلیم کا آغاز کیا۔ قرآ
چھوٹی فارسی کی کتابوں سے لے کر گلستان، بوستان تک تعلیم جاری رکھی۔ ان کے عالوہ بھی چند کتب آپ کی نظروں سے
ظاہر اور
ِم
گزریں۔ آنجناب کی تعلیم کے بارے میں بتانے کی ضرورت اس لیے محسوس ہوئی کہ میں آپ کو یہ بتا سکوں کہ عل

ظاہر کے متعلق آپ جان چکے ہیں۔ اب ذرا غور کیجیے کہ اس قدر قلیل علم اور پھر
ِم
باطن میں کیا فرق ہے۔ قبلہ و کعبہ کے عل
ِم
عل
جناب کی فصاحت و بالغت کے واعظ اور ایسے ایسے نکات بیان فرمانا کہ علماء بھی دنگ و ششدر رہ جاتے، کیا یہ ِان چند کتابوں
کا نتیجہ تھا؟ یہ تو اہِل نظر ہی جان سکتے ہیں کہ :۔

یہ فیضاِن نظر تھا یا کہ مکتب کی کرامت تھی
سکھائے کس نے اسماعیل کو آداِب فرزندی

باطنی
ِم
خاص یعنی عل
ِم
ایک آیت قرآنیہ کا مفہوم ہے کہ جب میں تم میں سے کسی کو منتخب کرلیتا ہوں تو اس کو اپنا عل

باطن سے ہر چیز کی کیفیت کو بخوبی پا سکتا ہے۔ اور دوستو! جس کو خدا چن لے، میں کون ہوں
ِر
عطا فرما دیتا ہوں اور وہ نو
اس کی تعریف کرنے واال۔ ایک اور بات میرے ذہن میں رہ رہ کر ابھر رہی ہے کہ خدا کے منتخب کرلینے کے معانی ہیں: اپنا ہم
راز بنا لینا کیونکہ ہر وہ فرمان جو ہم تک پہنچتا ہے، تو ِان ولی الله یا نبّی الله کی زبان درفشاں سے ہی ہم تک پہنچتا ہے۔ اس سے
معلوم ہوا کہ اہل الله اس کے ہم راز بھی ہیں اور اس سے ہم کالم بھی ہیں۔ ہمارے نبی کریم صلی الله عليه وآله وسلم نے بھی الله
می لقب پایا، لیکن دوستو! وہ کیا چیز تھی جس نے ایران و عراق کو جھکایا اور

تعالٰی کے سوا بظاہر کوئی علم حاصل نہ کیا اور ُا
وہ کون سی پالیسی تھی جس سے روم مشرف بہ اسالم ہوا۔ آپ صلی الله عليه وآله وسلم نے کوئی وکالت نہ پڑھی تھی، کوئی
پاک ببانِگ دہل
ِن
ڈگری حاصل نہ کی تھی، کسی کالج میں تعلیم حاصل نہ کی تھی، صرف ایک تھا پڑھانے واال جس کی قرآ
: گواہی دے رہا ہے

َبَیاَن۔ )9(
ْل
َمُہ ا
ْلُقْرٰاَن َخَلَق ا ِاْلْنَساَن َعَّل
َم ا
لَّرْحٰمُن َعَّل
َأ

رحٰمن نے ) اپنے حبیب محمد صلی الله عليه وآله وسلم ( کو قرآن پڑھایا، انسان ) کامل ، محمد صلی الله عليه وآله وسلم ( کو ( اللہ ) ‘‘

’’پیدا کیا، انہیں ) جو ہوچکا یا قیامت تک ہوگا، سب کا ( بیان سکھایا۔

ِر من کہ بمکتب نرفت و خط ننوشت
نگا
بغمزہ مسئلہ آمو ِز صد مدرس شد

میرا محبوب کبھی مکتب نہیں گیا اور نہ ہی لکھنا سیکھا لیکن اپنی ایک نگاِہ ناز سے سینکڑوں مدّرسین کو مسئلہ حل کرنا ‘‘

’’سکھا دیا ۔

ظاہر کیا ہے، اور ِان دونوں
ِم
باطن کیا ہے، اور عل
ِم
امید ہے کہ میرے اس مختصر سے بیان سے آپ پر واضح ہوگیا ہوگا کہ عل
علوم میں فرق کیا ہے؟ حضرت شیخ کے یوں تو بچپن کے بہت سے واقعات ہیں مگر میں یہاں دو کا ذکر کرتا ہوں۔
ابھی آپ پانچ برس کے تھے کہ اپنے ننھیال میں تشریف لے گئے۔ گاؤں کے پاس ہی ایک راہٹ تھا۔ اس پر خشک ایندھن کا
ڈھیر لگا ہوا تھا، آپ نے اسے آگ لگا دی تو اس انبار سے اس قدر بلند شعلے نکلے کہ گاؤں والے خوف زدہ ہوگئے اور آگ بجھانے
کے لیے کنوئیں کی طرف دوڑے مگر جب انہوں نے آپ کو پاس کھڑے دیکھا تو سب نے دریافت کیا کہ یہ آگ تو نے کیوں لگا دی
اور ہمارا سارے کا سارا ایندھن جال دیا؟ آپ نے فرمایا: بھائی میں نے ایندھن نہیں جالیا بلکہ روشنی کی ہے تا کہ اندھیرا دور
ہوجائے۔ یہ آثار آپ کے بچپن میں تھے۔ پھر آپ نے اجاال کرکے دکھایا اور ایسی روشنی کی کہ تمام اندھیرا دور ہوگیا، اور نور
اللہ سے ظلمِت شیاطین کو بھگا دیا۔

آپ چھوٹی عمر میں ایسی باتیں کرتے جن کو سن کر آپ کی شخصیت کے بارے میں کچھ اور گمان ہوتا۔ آپ بہت چھوٹے
تھے، اس وقت کی ایک حکایت ہے: پینے کے لیے جب آپ پانی مانگتے تو فرماتے کہ برتن بھرا ہوا لوں گا ورنہ نہیں۔ پانی دینے والے
ْیٍد کی صدا پھر ختم نہ ہوتی۔ آخر اہِل خانہ بہت تنگ آگئے اور ایک دن حضور کو کنوئیں پر
ِز
ِمْن َّم
ْل
لبالب بھر کے دیتے، لیکن َہ
لے آئے اور پانی کے آگے برتن رکھ دیا جو بہت جلد پانی سے بھر گیا اور کہا کہ اب یہ بھر گیا ہے، اٹھا کر پی لو، مگر جواب
میں پھر وہی صدائے بازگشت ہوتی۔ چونکہ وہ برتن پہلے سے ہی بھرا ہوا ہوتا اور جو پانی اور آتا، وہ باہر نکل جاتا۔ یہ سب
کچھ دیکھتے ہوئے بھی مانگنے واال خاموش نہ بیٹھتا، اور وہی سوال دہرائے جاتا۔ یہ دیکھ کر سب نے کہا کہ اس سائل کے سوال
کا جواب ہمارے تو بس کی بات نہیں ہے۔
یہ تشنگٔی عشق اس پانی سے کیسے بجھتی، یہ تو بغیر وصاِل حبیب کبھی ختم نہیں ہوتی، مانگنے واال آخر مانگ کے رہا،
اور ڈھونڈنے والے نے باآلخر پا ہی لیا۔ جب تک چہرٔہ محبوب سامنے نہ ہو، تسکین میّسر آ ہی نہیں سکتی۔

نظر ملے
ِق
تسکین کو ہم نہ روئیں جو ذو
ُحوراِن خلد میں تیری صورت مگر ملے

شروع ہی سے آپ بڑے عابد تھے، اور اذان و جماعت کا بے حد شوق تھا۔ وقت گزرتا گیا، عہِد شباب آن پہنچا، یہی آتِش
قطبیہ موضع سندھیلیانوالی لے گئی ‘ جس جگہ شمع
ِر
عشق جو لگائے نہیں لگتی اور بجھائے نہیں بجھتی، آپ کو کھینچ کر دربا

کامل حضرت سّید قطب علی شاہ بخاری رحمة اهلل عليه سے
ِخ
فروزاں ہو، پروانے خود آ ہی جاتے ہیں، اور سلسلہ قادریہ کے شی

ِن روح حاصل ہوئی اور قبلہ و کعبہ حضرت قطب االقطاب

پہلی مالقات ہوئی۔ اور یہی پہلی مالقات مؤثر ثابت ہوئی یعنی تسکی
رحمة اهلل عليه کے دسِت بیعت ہوگئے۔ دسِت بیعت کے معنی ہوتے ہیں : کسی کے ہاتھ پر ِبک جانا، اس لفظ کا صحیح معنی آپ نے بن
کامل کی نذر کردیتے اور فرماتے: یہ سب کچھ جس کا دیا ہوا ہے، اسی کے حوالے کرتا
ِخ
کر دکھایا۔ جو کچھ گھر میں ملتا، شی

کامل کے دربار میں پہنچتے۔
ِر
ہوں۔ اسی طرح آمد ورفت بڑھتی گئی، اور آپ کو جس وقت بھی غلبٔہ شوق ہوتا، فوًرا پی
سندیلیانوالی اور قادر بخش شریف کا درمیانی فاصلہ بیس میل تھا۔ یہ راستہ آج کے راستوں جیسا نہیں بلکہ آج سے پچاس برس
پہلے کا راستہ جب ہمارے عالقہ میں نہر بھی نہیں آئی تھی، بسوں، گاڑیوں کا تو سوال ہی پیدا نہیں ہوتا۔ یہ بڑا دشوار گزار
راستہ تھا، تمام جنگل پرخار تھا، ، دور دور تک پانی کا نشان نہ تھا، ہاں کہیں کہیں کنوئیں ہوتے تھے جن سے پانی میّسر آ
ِن عشق نہ جنگلی درندوں کا ڈر، نہ کانٹوں کی پرواہ۔ آہ! یہ سیِل محبت بھی انوکھی شئے ہے۔ پھو ل و

سکتا تھا، واہ رے طوفا

زیست نشہ نہ اترا، اور پھر یہ شراب تو
ِم
خار جو بھی آیا، ساتھ بہائے لیے جا رہا ہے۔ کتنا لطف ہے مئے الفت کا جس نے پی، تا د
نظروں سے پی جاتی ہے اور پالئی جاتی ہے، یہاں مقدار کا تقاضا ہی نہیں ۔
خمار چیز کی مقدار پر نہیں موقوف
شراب کم ہے تو ساقی نظر مال کے پال

جناب کا مؤدب ہونا۔ سبحان اهلل! جب بھی مجلِس شیخ میں بیٹھتے، اس جگہ بیٹھتے جہاں سب لوگوں کے جوتے پڑے ہوتے
ِن وعظ جب بھی میں اپنی نظریں چہرٔہ شیخ کی طرف اٹھاتا تو ان کی نظریں اپنے چہرہ

تھے۔ خود فرمایا کرتے تھے کہ دورا
پر گڑی ہوئی پاتا اور محبوب کو دیکھتے دیکھتے کبھی سیر نہ ہوتا۔

ِن خانہ تشریف لے

غوِث زماں حضرت پیر سّید قطب علی شاہ صاحب رحمة اهلل عليه ایک دن محفل برخاست کرکے اندرو
گئے۔ اور جاتے ہی گھر میں تمام اہِل خانہ کو بتایا کہ ایک سّید لڑکا ہے جو محفل میں تمام لوگوں کے پیچھے جہاں سب کے جوتے
پڑے ہوتے ہیں، وہاں بیٹھتا ہے، مجھے اس قدر پیارا لگتا ہے، جی چاہتا ہے کہ اس کو دیکھتا ہی رہوں۔ ایسے غوث کی اتنی پیار
بھری نظریں اس لیے پڑتی تھیں کہ وہاں ایک خزانہ پنہاں تھا جسے وہ افشا کرنا چاہتے تھے جو کہ بعد میں افشا ہوا اور جس
قطبیہ کی مسجد میں اذان دے رہے تھے کہ اعلٰی حضرت
ِر
کے اظہار پر الکھوں لوگوں کو فیض ہوا۔ ایک دن قبلہ و کعبہ دربا
پیرسّید قطب علی شاہ صاحب رحمة اهلل عليه تشریف لے آئے اور مسجد میں باہر کھڑے ہوکر اذان سنتے رہے۔ آپ اذان بہت سریلی
آواز میں پڑھا کرتے تھے۔ اعلٰی حضرت نے تمام اذان وہیں کھڑے کھڑے سنی اور اپنے ایک مصاحب کو ‘ جو کہ آپ کے خاص

مقرب تھے اور عالقہ کمالیہ ہی کے رہنے والے تھے، فرمایا کہ ‘‘یہ تمہارے عالقہ کے ہیں، ان کا خاص خیال رکھا کرو، اور اپنے
’’ساتھ ہی ان کے کھانے اور سونے کا انتظام کیا کرو۔
عرض کیا: بہت اچھا، حضور! میں ان کا خاص خیال رکھوں گا، لیکن اگر گستاخی تصور نہ کی جائے تو ایک گزارش
کرتا ہوں کہ ہم جو اس نوجوان سے مّدتوں پہلے کے غالم ہیں، یہ ہم سے کون سی زیادہ خاصیت رکھتا ہے کہ جناب اتنا خیال
فرماتے ہیں۔ جواب مال کہ جو کچھ میں دیکھ رہا ہوں، تم نہیں دیکھ سکتے۔ ایک دن آئے گا کہ دنیا اس کے آگے جھکے گی اور
تم لوگ اس سے رشک کرو گے۔ یہ جواب سنتے ہی وہ صاحب خاموش ہو گئے۔
بقول ان کے بعد ازاں میں ان کا خیال رکھنے لگا، اپنے ساتھ ہی کھانا کھالتا اور ساتھ ہی سالتا۔ غرضیکہ جتنا ہوسکتا
تھا، میں ان کی خاطر تواضع میں کوئی کسر نہ اٹھا رکھی تھی۔ انہی صاحب کا بیان ہے کہ ایک رات میں اور پیر محمد عبد
اللہ شاہ صاحب اکٹھے ایک چارپائی پر سوئے ہوئے تھےکہ مجھے ‘‘ُہو، ُہو’’ کی آواز سنائی دی اور میری آنکھ کھل گئی۔ میں نے
منہ سے لحاف ہٹایا، دیکھا کہ میرا ساتھی خواِب راحت میں تھا، لیکن یہ آواز تیز تیز ہوتی چلی جارہی تھی۔ میں بڑا حیران
ِن َچپ جہاں دل ہوتا ہے، ایک سوراخ جس سے یہ صدائے ِااَّل ُہو آ رہی
پستا
ِر
ہوا، آخر میں نے لحاف ہٹادیا اور دیکھا کہ ان کے زی
تھی، لیکن جب میں نے ان کے چہرے کو بنظ ِر غور دیکھا تو ان کی آنکھیں اور لب بند اور بالکل حالِت خواب معلوم ہوئی۔ تب
کامل جو فرمارہے تھے، یہ تو وہی آثار ہیں۔ دوستو! یہ ہے بھی اسی طرح، میں اس کی کوئی تشریح
ِر
مجھے معلوم ہوا کہ پی
نہیں کرنا چاہتا لیکن اتنا کہوں گا ۔

گوش بند و چشم بند و لب بہ بند
گر نہ بینی سِّر حق من بخند

اٰلہی کو نہ پاسکو تو میری بات کا بے شک ‘‘
ِز
تم غیر اللہ سے اپنے کان، اپنی آنکھ اور اپنے ہونٹ بند کرلو، پھر اگر تم را
’’مذاق اڑانا۔

ِر شیخ پر اس طرح رہتے کہ پتہ ہی نہ چلتا تھا، حاالنکہ پیر صاحب بہت خیال رکھا کرتے

آپ کا یہ معمول تھا کہ دربا
تھے۔ مسجد میں سو رہتے اور لنگر خانے اس وقت جاتے جب کہ سب لوگ کھانا کھا چکتے۔ ان کا بچھا کھچا روٹی کا ٹکڑا جتنا
بھی ملتا، تناول فرماتے۔ اهلل والوں کا معاملہ کچھ شروع سے ہی ایسا چال آ رہا ہے۔ یہاں میں ایک حکایت لکھنا مناسب سمجھتا
ہوں۔
ایک اعرابی حضرت سیدنا علی المرتضٰی کرم اهلل وجہہ الکریم کے پاس آیا۔ آپ گھر میں موجود نہ تھے۔ حضرت سیدنا
امام حسین رضي الله عنه نے ان کو مسجد میں بٹھایا اور بڑا پرتکلف کھانا لے کر آئے۔ جب اعرابی کھانا کھانے لگا تو حضرت امام
حسین رضي الله عنه سے عرض کرنے لگاکہ جناب! میں اس وقت تک کھانا نہیں کھاؤں گا جب تک اس آدمی کو ‘ جو کونے میں
بیٹھا روٹی کے ٹکڑے پانی میں بھگو بھگو کر کھا رہا ہے، کھانے میں شامل نہ کرلوں۔ حضرت امام حسین رضي الله عنه نے
غور ہے کہ خلیفۃ
ِم
جواب دیا: یہ میرے والد حضرت علی المرتضٰی رضي الله عنه ہیں اور یہ سب کچھ ان ہی کے فیض سے ہے۔ مقا
المؤمنین کی یہ سادگی ۔ کیا ایسی مثال کوئی پیش کر سکتا ہے؟ نہیں، ہرگز نہیں، البتہ وہ لوگ جنہیں آپ اہل الله کے نام سے
پکارتے ہیں، ان کے حاالت ایسے ہی ہوتے ہیں کیونکہ وہ لوگ حضرت علی کرم الله وجہہ الکریم کے نقِش قدم پر گامزن ہوتے ہیں۔

تیری خاک میں ہے اگر شرر تو خیاِل فقر و غنا نہ کر
قوِت حیدری
ِر
کہ جہاں مین ناِن شعیر پر ہے مدا

جن کو الله تعالٰی منتخب فرماتے ہیں، ان کے حاالت بچپن سے ہی عوام الناس سے بہت مختلف ہوتے ہیں۔ پھر ان کا شباب، اس
کے بعد ضعیفی، سب کے سب زمانے انوکھے ہوتے ہیں۔

ًا جو تبلیغ آپ نے فرمائی،

قبلہ و کعبہ کو تیس سال کی عمر میں خرقٔہ خالفت عطا ہوا اور آپ نے تبلیغ شروع فرمائی۔ غالب
شاید ہی کسی ولی اللہ نے کی ہو کیونکہ اکثر کتب میں، میں نے دیکھا ہےکہ ہر فقیر جو وعظ فرماتے تھے، ان کے وقت مقرر ہوا
کرتے تھے، مثًال محبوِب سبحانی حضرت شیخ عبد القادر جیالنی رحمة اهلل عليه ہفتہ میں تین بار وعظ فرمایا کرتے تھے۔ حضرت
خواجہ حسن بصری رحمة اهلل عليه ہفتہ میں صرف ایک بار، غرضیکہ سب کے وقت مخصوص تھے، لیکن جناب شیخ کا کوئی
محفل ہوتا۔
ِز
فجر اور اوراد و تالوت کے بعد باہر تشریف لے آتے اور آغا
ِز
وقت مقرر نہ تھا۔ آپ کا کام دن رات یہی ہوتا ، صبح نما

ِن وعظ کبھی کسی کو جرأت نہ ہوتی کہ مجلس

آپ تقریر شروع کرتے اور دوپہر بارہ بجے تک مسلسل تقریر فرماتے رہتے۔ دورا
سے اٹھ سکے یا اجازت لے سکے۔ اور اگر کوئی باہر سے آئے تو دور ہی سے سالم کرکے وعظ میں شامل ہوجائے کیونکہ اگر کوئی
وعظ میں مخل ہوتا تو آپ سخت غصہ کا اظہار فرماتے اور ہونا بھی اسی طرح چاہیے کہ آداِب محفل ہیں اور اسی لیے تو اللہ
: تعالٰی نے ارشاد فرمایا ہے

ِبِّي۔ )10(
ْم َفْوَق َصْوِت الَّن

َمُنْوا اَل َتْرَفُعْٓوا َاْصَواَتُك
ٰا
ِذْيَن
َّل
ُّيَها ا
َا
ٰٓي

’’اے وہ لوگو جو ایمان الئے ) بات کرتے وقت ( اپنی آوازوں کو نبی ) صلی الله عليه وآله وسلم ( کی آواز سے اونچا نہ کرو ۔ ‘‘
ِز ظہر وعظ فرنے

یعنی میرے محبوب کی بارگاہ میں اونچا بھی مت بولو۔ یہ آداب کے خالف ہے۔ القّصہ پھر بعد از نما
لگتے تو شام ہوجاتی بلکہ کبھی کبھی تو عشاء تک بھی یہ سلسلہ جاری رہتا۔ پھر یہ نہیں کہ اس کے بعد آپ گھر جا کر آرام
فرماتے بلکہ اندر جا کر بھر ایک گھنٹہ وہاں پند و نصائح فرماتے اور یہ معمول شروع سے لے کر آخر عمر اسی طرح رہا اور
آپ نے اس میں ذّرہ بھر فرق نہ آنے دیا۔
شروع میں گزارش کرچکا ہوں کہ یہاں جاہلیت حد سے زیادہ تھی اور اس جہالت کو علم میں بدلنے کا سہرا آپ کے سر
ہے۔ دن رات کی تبلیغ ان لوگوں کے لیے بہت مؤثر ثابت ہوئی اور تمام لوگ جوق در جوق آ کر آپ کے حلقہ ارادت میں شامل ہوگئے
اور وہ رسوماِت قبیحہ جو یہاں کے باشندوں کو بری طرح گھیرے ہوئے تھیں، ان کا قلع قمع ہوگیا۔ صرف یہی نہیں کہ بری
عادتیں لوگوں نے چھوڑ دیں بلکہ قادر بخش شریف اور گرد و نواح کے تمام عالقے ذکر ‘‘ اَل ِاٰلَہ ِااَّل اللُہ ’’ سے گونج اٹھے اور
پنجگانہ نماز کے عالوہ لوگ تہجد گزار بھی بن گئے۔ یہ درست ہے کہ جب حق آتا ہے تو باطل بھاگ جاتا ہے۔ جہاں نور آجائے،
وہاں ظلمت نہیں ٹھہرتی۔
آپ کا یہ اقتدار ان لوگوں کو ایک آنکھ نہ بھایا جو مّدتوں پہلے اس عالقے پر حکمرانی کر رہے تھے۔ وہ لوگ ہندوؤں
میں بھی تھے اور مسلمانوں میں بھی۔ انہوں نے آپ پر ہر طرح کے حملے کیے ، الزام لگائے تا کہ یہ شان و شوکت مٹی میں مل
کریم میں بھی آیا ہے
ِن
: جائے، لیکن یہ شان و شوکت تو اس رِّب لم یزل کی عطا فرمائی تھی، اسے کون ختم کرسکتا تھا۔ قرآ
ِفُرْوَن۔ )11(
ْلٰك
َه ا
ِر
ْو َك
َوَل
ٗه
َاْن ُّيِتَّم ُنْوَر
آَّل
ُه ِا
ّٰل
َبى ال
ْم َوَيْا
َواِهِه
َاْف
ِه ِب
ّٰل
ْيُدْوَن َاْن ُّيْطِفـــُٔــْوا ُنْوَر ال
ِر
ُي

وہ چاہتے ہیں کہ اللہ کے ) نبی محمد صلی الله عليه وآله وسلم کی نبّوت کے ( نور کو اپنے منہ ) کی باتوں ( بجھا دیں مگر الله ‘‘
’’اپنے ) نبی محمد صلی الله عليه وآله وسلم کی نبّوت کے ( نور کو پورا کیے بغیر مانے گا اگرچہ کافر ) اسے ( نہ پسند کریں۔

نو ِر خدا ہے کفر کی حرکت پہ خندہ زن
پھونکوں سے یہ چراغ بجھایا نہ جائے گا

باطل کے طوفان آئے، آندھیاں اٹھیں لیکن حق کا بال بیکا نہ ہوسکا۔ نمرود نے حق ہی کے مقابلے میں آگ کی چتا تیار
کروائی، اور آپ جانتے ہیں کہ حق مسکراتے ہوئے چتا میں داخل ہوگیا۔ خوف ہے تو باطل کو، غم ہے تو باطل کو۔
مریدین و معتقدین کی گزارش پر آپ نے دعوتوں پر جانا شروع کیا۔ یہ دعوتیں ہماری تقریبات یا ہماری عام دعوتوں جیسی
نہ تھیں بلکہ یہ اور رنگ کی ہوتی تھیں۔ ہر سال کا آپ کا یہ پروگرام بن گیا تھا۔ یہ ٹھیک ہے کہ ہم اس پروگرام کو یا اس

سفر کو دعوت کا ہی نام دے سکتے ہیں، لیکن اگر دیکھا جائے تو یہ دعوتیں نہیں بلکہ تبلیغ اور مجاہدہ ہے۔ آپ کہیں گے: بھال!
جہاں پر تکلف کھانے اور پر تپاک خیر مقدم ہو، اسے مجاہدہ کیونکر کہا جا سکتا ہے؟ بجا، مگر یہ خیال صرف اسی صورت میں
درست ہے جب کہ دعوتوں کا منتہائے مقصود اکل و شرب اور لہو و لعب ہو، یہاں ایسا نہیں۔
ذرا تفصیِل پروگرام مالحظہ ہو: یہ سفر بیس دن سے کم کا نہیں ہوتا اور ہر روز تیس میل سے زیادہ سفر طے کرنا پڑتا ہے۔
پھر یہ سفر بھی ایسا نہیں کہ آرام سے قطع ہو بلکہ کچی اور ناہموار راہوں پر کچھ لوگ پیدل، کچھ سائیکلوں پر، کچھ
گھوڑوں اور یکوں پر یہ سفر طے کرتے ہیں۔ جس گاؤں میں کھانے پینے کا انتظام ہو، وہاں بھی اور راہ میں آنے والے ِادھر
دھر کے ان دیہاتوں میں بھی جہاں کھانے کا نتظام نہیں ہوتا، محض ٹھہرنا ہی نہیں ہوتا بلکہ ہر مرید کے گھر پر پہنچ کر
ُا
اس کی دل جوئی کرنا بھی پروگرام کا ضروری حّصہ ہے، خواہ یہ قیام چند لمحوں کے لیے ہو ، اور اس طرح مہینوں کا سفر
دنوں میں پورا کیا جاتا ہے۔
اس سے قبل بھی بیان ہوچکا ہے کہ قبلٔہ دل و جان کے ساتھ ہزاروں کی تعداد میں آدمی ہوتے مگر آپ ہر غریب، امیر کا
برابر خیال کرتے، ان کی سواری، ان کے کھانے پینے اور ٹھہرنے کے انتظامات کی نگرانی فرماتے۔ صاحِب خانہ صرف جو کچھ
چاہتا، پکا دیتا مگر جب قبلہ دعوت پر تشریف فرما ہوتے تو سارا کام درویش خود کرتے۔ اب قابِل ذکر بات یہ ہے کہ جماعت کے
ساتھ ہر قسم کے آدمی ہوتے یعنی اونٹ سوار، گھوڑے سوار، ٹانگے سوار، سائیکل سوار اور پیدل ، سب کے سب ایک وقت پر
پہنچتے۔ صرف یہی نہیں کہ ہر دعوت پر کھانا ہی کھانا ہوتا بلکہ ذکر فکر، پند و نصائح اور محفِل سماع کا سلسلہ گرم ہوتا۔
قبلہ و کعبہ خود وعظ فرماتے، علماء کرام جو شریِک سفر ہوتے، وہ بھی تقریریں کرتے اور قوال پارٹیاں بھی برابر کا حّصہ
لیتی تھیں۔ یہ دعوتوں کا سلسلہ اب بھی جاری ہے اور پروگرام میں کسی قسم کی تبدیلی واقع نہیں ہوئی۔ اب فیصلہ آپ پر ہے ،
کیا انہیں آپ دعوتیں کہیں گے یا کوئی اور نام دیں گے۔ جناب شیخ کا ہر طریقہ انوکھا اور ہر ڈھنگ نراال تھا۔ جس وقت آپ
تقریر فرماتے، ہر فرد یہ محسوس کرتا کہ یہ میرے حال پر کالم فرما رہے ہیں۔ ہر فرد جو کدورتیں اور جو سوال دل میں ہے، لے
کر محفل میں بیٹھتا اور وعط کے اختتام پر ہر ایک مطمئن ہوتا۔ کوئی سوال باقی نہ رہتا، کوئی ہچکچاہٹ نہ ہوتی جو قابلِغور
ٔی
توحید ہر وقت آپ فرماتے اور حدوِد شرعی کے خالف کرنے والوں کو سخت سزا دیتے، پابند
ِن
ہو اور یہی کامل کا کمال ہوتا ہے۔ بیا

محمد صلی الله عليه وآله وسلم کا خود ایک مجسمہ تھے اور محمد صلی الله عليه وآله وسلم کے
ِن
وضو اور نماز پر زور دیتے۔ فرما
نقِش قدم پر ہر مرید کو چالیا جاتا۔ ہر شخص جانتا ہے کہ محمد پاک صلی الله عليه وآله وسلم کی پیروی میں نجات ہے مگر جب آپ
اس موضوع پر لب کھولتے تو آنکھوں کے آگے محبوِب پاک بیٹھے نظر آتے۔ یہ مبالغہ نہیں بلکہ جاننے والے اس حقیقِت حال پر
شاہد ہیں ۔

تیری مجلس مجلُس الله تھی
دونوں عالم کی جہاں گم، راہ تھی
مجمع البحرین تجھ سا بعد ازاں
گردِش دوراں نے دیکھا تھا کہاں

ہر
ًا
پنجگانہ کے عالوہ آپ تہّجد ادا فرماتے اور تقریب
ِز
اب آپ کی عبادت کے بارے میں تھوڑا سا بیان کرنا چاہتا ہوں۔ نما

فجر تک جائے نماز پر بیٹھے ذکر
ِز
مرید کو اس کا حکم دیتے، رات کو نو بجے آرام فرماتے اور پھر ایک بجے بیدار ہوتے اور نما
میں مشغول رہتے، اور اس قدر روتے کہ میں بیان نہیں کرسکتا۔ رونے کی وجہ سے آپ کی آنکھوں کے نیچے چھوٹے چھوٹے سیاہ
حلقے بن گئے جو کہ اکثر فقراء کے ہوتے ہیں۔ گریہ کو آپ بے حد پسند فرماتے۔ کوئی کتنا گنہگار ہوتا، آپ کے حضور میں پہنچ کر
ہے کہ سب نیکیوں اور اچھے کاموں سے مجھے گنہگار کے
باری تعالٰی
ِن
رونے لگتا تو فوًرا معاف فرما دیتے، اور فرماتے کہ فرما

ِر
وہ آنسو جو میرے خوف و محّبت میں بہائے جائیں، بہت پسند ہیں کیونکہ یہ آنسو اس کے گناہوں کو دھو سکتے ہیں اور عذ
نجات ہوسکتے ہیں۔

ِز جمعہ محفل آراستہ ہوتی جس

ہر جمعہ بڑا پر رونق ہوتا جس پر دور و نزدیک کے عقیدت مند اکٹھے ہوتے اور بعد از نما

پیر کی غزلوں کا خاص خیال و لحاظ ہوتا۔ یہ تمام سلسلہ بدستور اب بھی جاری ہے۔ اس کے عالوہ ماِہ
ِن
مین نعت خوانی، شا

محّرم کے تین دن ’ آٹھ، نو، دس محّرم الحرام ، کو علماِء کرام کو بال کر واقعہ کربال پر روشنی ڈالی جاتی، اور جتنے مصائب و
آالم حضرت سیدنا امام حسین رضي الله عنه پر گزرے، ان کو بیان کیا جاتا اور یاِد اسالم تازہ ہوتی۔ چونکہ جناب شیخ خود عاش ِق
حبیب تھے، لٰہذا عشاق کے حاالت سے بڑا پر لطف اٹھاتے اور کیوں نہ ہو، عشق کے بغیر کچھ بھی نہیں۔ خدا تعالٰی کو عشق نہ
ۃ والسالم کلیم الله ، حضرت سیدنا عیسٰی

ہوتا تو یہ دنیا معرِض وجود میں نہ آتی اور حضرت سیدنا موسٰی علٰی نبّینا و علیہ الصلٰو
علیہ السالم روح اللہ نہ بنتا اور میرا محبوب محمد مصطفٰی صلی الله عليه وآله وسلم حبیب الله نہ بنتا۔ ان سب کا ظہور عشق سے
ہےاور پھر اس عشق کی ابتداء تسلیم و رضا اور عجز و نیاز ہے۔
اس بے نیاز نے اپنے حبیب لبیب صلی الله عليه وآله وسلم پر کیا کیا آزمائشیں ڈالیں مگر حبیب پاک صلی الله عليه وآله وسلم نے

تسلیم و رضا بن گئے۔ حضرت امام حسین رضي الله عنه

اف تک نہ کی بلکہ پیک ِر
ہی کو دیکھیے ! کس قدر آزمائشیں آئیں، تمام کنبہ شہید ہوگیا، بچے پیاس سے بلکتے رہے،بیبیاں قیدی ہوئیں، غرضیکہ کوئی ایسا
دکھ، کوئی غم مصیبت ایسی نہ تھی جو امام عالی مقام پر نہ آئی لیکن جواب میں سوائے نیاز او رتسلیم کے کچھ نہ تھا۔

مقامات عشق
ِق عشق کی ابجد ہے اثر عجز و نیاز
سب

تسلیم و رضا ہوجانا

یعنی ِاک پیک ِر

فنا فی المحبوب
ِر
آخری باب میں ہے ذک
یعنی محبوب کی الفت میں فنا ہوجانا
بقا کی مستی
ِم
اس فنا میں ہے مگر جا
ہے یہی بندے کا ہم رنِگ خدا ہوجانا

آپ کی زندگی کے حاالت کو قلم بند کرنا میرے تو بس کا روگ نہیں۔ اتنے واقعات ہیں، اتنی کرامات ہیں جن کو تحریر
کرنے کے لیے دفتر درکار ہیں۔ اور اگر دیکھا جائے تو

۔ )12(
ُل
ُجَّھا
ْل
َرَھا ا
ُم ُنْقَطٌۃ َکَّث
ِعْل
َأْل

’’علم تو محض ایک نقطہ ہے، جاہل لوگوں نے اس کو بہت بڑھا دیا ہے ۔ ‘‘

حضرت سیدنا علی المرتضٰی کرم الله وجہہ الکریم کا یہ فرمان’ سب دالئل، تمام ثبوت، لمبی تحریریں، فصیح و بلیغ

دل اور راحِت جان ملتی ہے۔
ِن
تقریریں، سب اس ایک نقطہ میں آجاتی ہیں اور اس سے سکو
بندٔہ مومن کو الله تعالٰی بیماری، بھوک یا ذلت ، ان تینوں چیزوں سے نوازتا ہے۔ قبلٔہ ام کو یہ دو چیزیں یعنی امراض و
الزام عطا فرمائی گئیں۔ بظاہر ہماری نظر میں یہ چیزیں سزا ہیں اور اہل الله کی نظر میں عطا ہیں کیونکہ ہر وہ چیز جو
محبوب کی طرف سے آئے ‘ خواہ عتاب ہو یا ثواب، مسکراتے ہوئے قبول کرتے ہیں اور اس کے ہر فعل پر صابر و شاکر رہ کر اسے
خوش کرتے ہیں۔ یہی اختالف ہے اہل الله میں اور ہم میں ، ضبط و تحمل اور صبر و شکر سے ہم دور ہیں۔ الله تعالٰی کی بھیجی
ہوئی نعمتوں سے ناشکری اور تکلیفوں میں بے صبری، یہ ہمارا شیوہ بن چکا ہے۔ حضور کو مختلف امراض الحق تھیں اور
شروع سے رہیں۔ ان امراض کے باوجود قبلٔہ ام نے اپنی ذمہ داریوں میں فرق نہ آنے دیا اور نہ ہی تبلیغ میں۔ آخر میں آپ کو
امراض نے گھیر لیا اور خدا کا یہ انعام بڑھتا گیا۔ پہلے تو آپ باہر تشریف التے رہے لیکن بعد میں کمزوری کی وجہ سے نہ آسکتے
تھے۔

ًا
فوقت
ًا
مکمل ایک سال تک آپ کو بہت تکلیف رہی۔ اس شمع حقیقی کی زیارت کے لیے ہر وقت پروانوں کا ہجوم رہتا اور وقت
تمام لوگوں کو گھر میں بال کر زیارت کرائی جاتی۔ بروز جمعہ قریب و بعید سے آئے ہوئے تمام مریدین گھر میں بلوائے جاتے اور
آپ ان سب کو تھوڑی سی تبلیغ فرماتے اور اپنے اس جہان کو چھوڑنے کے متعلق اشاروں ہی اشاروں میں بتا دیتے اور فرماتے کہ
میرے بعد یہ میرا بتایا ہوا علم و عمل کسی قیمت پر ترک نہ کرنا۔ اسی میں تمہاری فالح ہے اور نجات ہے۔ یہ علم میرا نہیں بلکہ
زیست نہ چھوڑنا۔ ان مالقاتوں کا سلسلہ
ِم
محمد صلی الله عليه وآله وسلم کا علم ہے۔ اس رسی کو مضبوط پکڑے رکھنا اور تا د

ِن الہور کے اصرار پر الہور لے جایا گیا مگر کوئی

خاص کی خاطر مریدی
ِج
ایک سال تک یونہی جاری رہا اور پھر آپ کو عال
افاقہ نہ ہوا اور آپ واپس تشریف لے آئے۔

دربار میں بڑ کے ایک چھوٹے پودے کے نیچے ‘ جو خود حضور نے

اجالس فرمائی، وہ صح ِن

اور آپ نے آخری تقریر جو س ِر
بڑے َبڑ’ کے گرنے کے بعد لگایا تھا’ فرمائی۔ آپ نے تقریر کے اختتام پر بڑ کو مخاطب کر کے فرمایا کہ اے بڑ! تم بھی شکوہ نہ کرنا
ِر حق نہ ہوا۔ میں تمہارے گلے شکوے ختم کرنے کے لیے یہاں وعظ کررہا ہوں۔ یہ آپ کا الوداعی وعظ اس

کہ میرے سائے میں ذک
قدر پر اثر اور لبریز از ذوق و شوق تھا کہ بیان نہیں کیا جا سکتا۔ پھر آپ کی صحت دن بدن گرتی چلی گئی۔ ماِہ محّرم الحرام
آیا، حضور کی تکلیف کی وجہ سے محفِل امام حسین رضي الله عنه منعقد کرنے کا کوئی پروگرام نہ تھا لیکن جب وہ تاریخیں آئیں
ِر حسین رضي

ِر رسول صلی الله عليه وآله وسلم اور ذک

تو حضور نے تمام کو ڈانٹا کہ میرے مریض ہونے کا یہ مطلب تو نہیں کہ ذک
الله عنه ترک کردیا جائے، لٰہذا یہ پروگرام اسی وقت مرتب ہوگیا اور علماِء کرام نے واقعِٔہ کربال پر روشنی ڈالی۔
یہاں ایک واقعہ یاد آیا۔ ایک ہومیو پیتھک ڈاکٹر اسماعیل اختر نامی الئل پور سے جناب کے عالج کے لیے آیا کرتے تھے۔
ایک دن انہوں نے قبلہ گاہی سے یہ سوال کیا کہ ٍمیری سمجھ میں آج تک یہ بات نہیں آئی کہ جو بھی الله کی طرف جائے یا اس
کے راستے پر گامزن ہو، اللہ تعالٰی اسے تکلیف، بیماری یا بھوک وغیرہ، اس قسم کی مصیبتوں میں مبتال فرما دیتا ہے ۔ حاالنکہ
چاہیے تو یہ تھا کہ جو بھی اس راستے پر آئے، اسے ہر قسم کی نعمتوں سے ماال مال کردیا جائے تا کہ دوسرے لوگ بھی اسے دیکھ
کر رشک کریں او اس طرف رجوع کریں کہ بھئی اس آدمی کو اللہ تعالٰی کے راستے پر جانے سے کس قدر خوش حالی ہوئی،
ہمیں بھی جانا چاہیے لیکن باری تعالٰی اس کے بر عکس کرتا ہے ؟
حضور نے اس سوال کا جواب اس طرح بیان فرمایا کہ ڈاکٹر صاحب! بات در اصل یہ ہے کہ اگر آزمائش، تکلیف و مصائب
کرنے لگے۔ لٰہذا الله تعالٰی نے یہ ایک کسوٹی بنائی ہے کہ جو صادق ہیں، وہ ثابت
ٰی
نہ ہوں تو ہر شخص نبّوت اور والیت کا دعو
قدم رہیں گے اور جو کاذب ہیں، وہ ُدم دبا کر بھاگ جائیں گے۔دوسرا یہ کہ ہر ایک اپنوں ہی سے پیار کرتا ہے، اپنوں ہی سے کام
لیتا ہے اور غیروں کو کبھی کچھ نہیں کہتا کیونکہ جو اپنے ہوتے ہیں’ وہ اپنوں کے کسی فعل پر اعتراض نہیں کرتے اور بیگانے
تو بیگانے ٹھہرے، جن سے کوئی امید نہیں رکھی جا سکتی، لٰہذا وہ پیاروں کو زیادہ دکھ دیتے ہیں کہ مجھے بھولیں نہیں،
اور غیروں کو سکھ دیتا ہے کہ وہ عیش و آرام میں کھوجائیں اور مجھ سے غافل رہیں۔

زیست اس کی
ِم
تیسری وجہ یہ ہے کہ جب ایک محبوب بنا لیا جائے تو محب کو چاہیے کہ وہ اسی کا ہوجائے اور تا د
چوکھٹ سے سر نہ اٹھائے۔

پھر جی میں ہے کہ در پہ کسی کے پڑے رہیں
سر زیر بار م ِتّن درباں کیے ہوئے

اور عہِد وفا کو نبھانے کی کوشش کرے۔ یہ تو آپ جانتے ہیں کہ وفا دار پر کتنے حملے ہوتے ہیں۔ ان کو اپنی جان محبوب کے
مقابل مہنگی نہیں ہوتی کیونکہ ان کا سب کچھ وہی ہوتا ہے جسے وہ سوچ سمجھ کر دل دیے ہوئے ہیں۔ پھر یہ مناسب نہیں کہ
وہ اپنا قدم پیچھے ہٹائیں۔ یہاں آپ نے ایک ہندی شعر فرمایا کہ ایک شخص کا گزر ایسے درخت کے پاس سے ہوا جو جل رہا ہے،
اور اس پر ایک پرندہ بیٹھا ہے، لٰہذا وہ شخص حیران ہو کر کہتا ہے۔

آگ لگی اس برچھ کو، جلنے الگے پات

اڑ جا بھولے پنچھیا، پر ہیں تمہارے ساتھ

:پرندے نے جواب دیا

پھل کھائے اس برچھ کے بٹیوں بھرے پات
اڑنا کام نہیں اب اپنا، جل مرنا ہے ساتھ

اس نے کہا کہ کیا ہوا ، تمام عمر میں نے اس درخت پر گزار دی اور اس کے پھل کھاتا رہا اور ہر قسم کی سہولت میّسر
آتی رہی۔ اب اگر میرے اس محسن پر وقت آیا تو میری وفا کیا ہوئی کہ اسے جلتا چھوڑ کر کیسے اڑ جاؤں، اب تو اس کے ساتھ
مریں گے، اسی کے ساتھ جیئیں گے۔ وفا بھی کوئی چیز ہے۔ آپ کے اس جواب کا ڈاکٹر صاحب کے دل پر بھی بڑا اثر ہوا اور اس

ًا چار پانچ گھنٹے یہی حالت رہی۔

نے گریہ شروع کردیا، اور تقریب
ہمیشہ مؤثر بات اس کی ہوتی ہے جس کا قول، اس کے فعل کے موافق ہو، علم، عمل کے خالف نہ ہو، بے طمع ہو اور یہ سب
چیزیں ولی کامل میں پائی جاتی ہیں۔ ہاں تو محّرم الحرام کی محفلیں ختم ہوگئیں۔ آپ کی طبیعت نہ سنبھلی لیکن کسی کو یہ
گمان نہ گزرتا تھا کہ جناب واال ہماری گنہگار نظروں سے پوشیدہ ہونے کو تیار ہیں۔آپ صاف صاف لفظوں میں ہمیں بتاتے رہے
لیکن ہمیں یقین نہ آیا۔ اس کی وجہ یہ تھی کہ ایک تو ہم لوگ متقین میں سے نہ تھے اور دوسرے کسی کا دل کب چاہتا ہے کہ
اس کا محبوب اس سے جدا ہو۔ اور ہمارا یہ محبوب بھی انوکھا تھا جس سے ہماری زندگیاں وابستہ تھیں، جس کے سہارے شاہ
و گدا جی رہے تھے، جو ہمیں اندھیروں سے بچانے کے لیے مشعِل راہ تھا۔ یہ سوچتے کہ اگر خدا نخواستہ یہ مشعل گل ہوگئی تو
بس اس سے زیادہ ق ِتّو سوچ و بچار نہ ہوتی اور گھناؤنے اندھیرے ہمیں ڈسنے کو دوڑتے۔ ہم انہی اندھیروں میں ڈوب جاتے لیکن
ِخ
پھر جب اس حسین چہرہ پر نگاہ پڑتی، ان پیاری خوب صورت گول آنکھوں سے آنکھوں کی مڈ بھیڑ ہوتی، ہر بار اس ر
مہتاب کے نئے انداز ہوتے، ان روشن آنکھوں سے نئے راستے کھلتے نظر آئے جو ہمارے لیے باعِث تسکین و اطمینان ہوجاتے۔

ہنسا ہنسا کے شِب وصل اشکبار کیا
تسلیاں ہمیں دے دے کے بے قرار کیا

تین چار دن اسی کشمکش میں گزرے۔ آخر وہی ہوا جس کا ہمیں ڈر تھا، وہی غم کا پہاڑ ہمارے اوپر گرنے کو تیار تھا۔
قبلہ محترم نے بندٔہ حقیر سے کئی بار وقت’ دریافت فرمایا، اور بار بار پوچھتے رہے کہ لنگر تقسیم ہوا ہے یا نہیں؟ یہ واقعہ پندرہ
محّرم الحرام کا ہے۔ میری مضطرب نگاہیں کئی بار ٹائم پیس کی طرف اٹھیں اور سوچتا کہ آپ بار بار وقت کیوں پوچھ رہے
ہیں؟ گیارہ بجے دن بندہ نے کچھ خوراک حضور کو دی جو کہ مجھے ہی کھالنے کا حکم ہوا۔ میں نے اپنے ہاتھوں سے چند چمچے
مبارک میں دیے اور پھر آپ مجھ سے مخاطب ہوئے اور فرمایا کہ میری قسمت میں اس دنیا پر یہ آخری
ِن
چاول کے جناب کے دہ
طعام ہے۔ میں نے کچھ اور کھانے کو کہا تو فرمانے لگے: جو کچھ میں دیکھ رہا ہوں، تمہیں کیا خبر، بس اب تنگ نہ کرو۔ اس
کے بعد آپ نے لنگر کے بارے میں دریافت فرمایا۔ عرض کی گئی کہ جناب! لنگر تو تقسیم ہوچکا ہے۔ فرمانے لگے: بہت اچھا ہوا، اس
لنگر کو اسی طرح جاری رکھنا کیونکہ تمام نیک اعمال سے یہ بڑھ کر ہے۔ پھر آپ نے وقت پوچھا۔ اس وقت پونے دو بجے تھے۔

درفشاں سے فرمایا
ِن
:چند لمحوں کے بعد حضور نے اپنی زبا
الحمد الله! کہ محبوب سے مالقات کا وقت آگیا ہے۔’’اور قبلہ و کعبہ ۱۵ محرم الحرام بروز پنج شنبہ ) جمعرات ( ۱۳۸۱ ھ ‘‘
بمطابق 29 جون 1961ء ہم سے رخصت ہوگئے۔

گراں ہم سب کے اوپر آن پڑا ہے، اس کا برداشت کرنا بڑا مشکل ہے اور ہم میں سے
ِر
ہر ایک کا یہ خیال تھا کہ جو غم کا با
ضرور کوئی نہ کوئی ہوش و حواس کھو بیٹھے گا، لیکن اللہ تعالٰی نے وہ رحمت فرمائی کہ سب کے سب بالکل درست رہے۔ اگلے
دن جمعہ تھا اور جناب کے وصال کی یہ خبر ہوا کی طرح پھیل گئی، اور صبح تک تمام عزیز و اقارب اور جماعِت مریدین’
آستانہ عالیہ پر پہنچ گئے۔ اس قدر مخلوق میری نظروں نے پہلے کبھی نہ دیکھی تھی۔ زمین پر تل دھرنے کی جگہ نہ تھی۔
خیر آپ کو تجہیز و تکفین کے بعد باہر الیا گیا۔ آنکھوں کے آگے مہیب سائے گھوم رہے تھے۔ یہ مکان، یہی دیواریں، یہی گلستان

جنہیں دیکھنے سے مسّرت ہوتی تھی، اب یہی ہمیں گھور رہے تھےاور انہی سے ڈر لگتا تھا۔ آپ کے جسد خاکی کو جنازہ گاہ
ِق خدا ہی نظر آتی تھی۔ اتنے بڑے ہجوم کو آخری زیارت کروانا ہی

میں الیا گیا جہاں جنازہ پڑھا گیا۔ جس طرف دیکھو، خل
مشکل ہوگیا تھا اور بہت لوگ ایسے بھی رہ گئے جو زیارت سے مشرف نہ ہوسکے۔ بہت لوگ شرکِت جنازہ بھی نہ کرسکے،
حاالنکہ جمعرات دو بجے وصال ہوا، اور جمعہ دس بجے آپ کا جنازہ پڑھا گیا۔ اس کے بعد حضور کو مرقد شریف میں دفن کردیا
گیا، اس طرح آپ اپنے پروانوں کو تڑپتا چھوڑ کر اپنے محبوب حقیقی کے پاس پہنچ گئے۔

ِغ
ِن خدا تعالٰی کبھی نہیں مرتے لیکن بظاہر ہماری آنکھوں سے تو دور ہوجاتے ہیں، اور یہ دا

یہ ٹھیک ہے کہ مردا
مفارقت بڑا صبر آزما ہوتا ہے۔ وقت بڑا مرہم ہے۔ بڑے سے بڑا مرہم بھی مندمل ہوجاتا ہے لیکن وہ خال جو ایسی ہستی کے چلے جانے
سے ہوجاتا ہے، اسے ُپر کرنا ناممکن ہوجاتا ہے۔

اسالم مکمل
ِن
فانی سے جب پردہ پوش ہوئے تو اس وقت دی
ِر
حضرت سیدنا محمد رسول الله صلی الله عليه وآله وسلم اس دا
تھا، لیکن ایسا خال پیدا ہوگیا جو ُپر ہونا بڑا مشکل ہوگیا تھا۔ گو خلفاِء راشدین نے بڑی تندہی سے کام کیا لیکن پھر بھی وہ خلش
جو تمام قوم اور صحابہ کرام رضوان الله تعالٰی علیہم اجمعین کے دل میں تھی، دور نہ ہوسکی۔ اسی طرح ہم انہیں بھول تو
ہی
ٰل
ا
ِم
جائیں لیکن ان کو بھولنا بھی آسان نہیں کیونکہ جس نے ہمیں خدا تعالٰی کا راستہ بتایا، ظلمت سے نور کی طرف الیا، عل
سے روشناس کرایا، اس کے احسانات کا ہم پر بوجھ اتنا ہےکہ ہم الکھ کوشش کریں، اتار نہیں سکتے۔ اگر احسان کا بدلہ ہے تو

ِااَّل ا ِاْلْحَساُن۔’’ )13( ‘‘
ِن
َجَزاُء ا ِاْلْحَسا
َھ ْل

احسان کا بدلہ احسان ہم صرف یہ کرسکتے ہیں کہ اس کی نعمتوں کا شکر سے جواب دیں اور ُاس کے بھیجے ہوئے ِاس
قاصد کی یاد ِدل سے تاعمر لگائے رکھیں جس نے ہمیں سرکشی کے دریا میں غرق ہونے سے بچا لیا، ہمارے حاالت سنوار دیے، اسے
بھولنا ہمارے بس کا روگ نہیں۔ اور دعا ہے کہ کوئی بھی ایسی ہستی کو نہ بھولے جسے بھولنے سے اللہ تعالٰی ناراض اور جسے
یاد رکھنے سے خداوند کریم خوش ہوتا ہے۔ میں سب کچھ بھول جاؤں گالیکن اپنے شیخ کے پیار، ان کی باتیں کبھی بھی نہ بھول
سکوں گا۔

ما ہر چہ خواندہ ایم فراموش کردہ ایم
ِااّل حدیِث دوست کہ تکرار مے کنیم

’’ہم نے جو بھی پڑھا ہے، اسے بھال دیا ہے ، سوائے محبوب کی پیاری باتوں کے کہ ہم اس کا تکرار کرتے رہتے ہیں ۔ ‘‘
قبلٔہ ام کے وصاِل پرمالل کے بعد اس سجادٔہ شریعت و طریقت کی سپرد داری بھی کسی ایسی شخصیت کے ذمہ ہونی چاہیے
تھی جو اس قابل ہو کہ اس عظیم مشن کے ہر پہلو پر پورا اترے اور عقیدت مندوں کے دینی و دنیاوی مقاصد کا ذمہ دار ہو، بے
کس و ناچار’ راہ روؤں کا راہبر بن سکے، ان کو دنیا اور راِہ سلوک کی پر خطر گھاٹیوں اور نشیب و فراز سے آگاہ کرے، اور
الفت کھو چکے تھے، جن کے اندھیرے گھروں کا’
ِع
ان شکستہ دلوں کے لیے تسکین و اطمینان کا سامان میّسر کرے جو اپنی شم

ہستی کو دیکھنے والی آنکھیں شرِف دیدار سے محروم ہوچکی تھیں۔
ِر
حسین چراغ راہی ملِک بقا ہوگیا، اور اس نو

حقیقی سے روشن کی گئی ہو، ایسا ہاتھ چاہیے تھا جو ید اللہ کا مصداق ہو، ایسی
ِع
اب ایسی شمع چاہیے تھی جو اس شم
موج کی ضرورت تھی جو ڈوبنے والوں کو دھکیل کر ساحِل مراد تک پہنچا دے، چنانچہ ایسی شخصیت کو تالش نہ کرنا پڑا،
کسی سہارے کی ضرورت نہ پڑی کیونکہ یہ کام مرشدی و موالئی اپنی حیاِت با برکات میں ہی مکمل فرما گئے تھے۔
یعنی مکّرم و محترم پیر سّید محمد نواز شاہ صاحب رحمة اهلل عليه ‘ جو صحیح معنوں میں اس سجادگی کے مستحق تھے،
ُدر فشاں سے ہر خاص و عام مرید کے لیے ہو چکا تھا، اس میں کسی کو کوئی اعتراض نہ تھا،
ِن
کی تقلید اور اتباع کا فرمان زبا
کوئی الجھن نہ تھی۔ تمام متبعین یعنی پیروکار اس امرسے راضی و خوش تھے کہ شیخ ہم پر کتنا مہربان ہے۔ اپنے اس جہان سے
رخصت ہوجانے کے بعد بھی ہم پر وہی مالطفت فرمائی جو بقیِد حیات ہونے پر فرمایا کرتے تھے، یعنی ہمارے ہاتھ ایسے ہاتھ میں
سونپے جو ان تک پہنچا ہوا تھا۔ چنانچہ تمام مریدین نے حسِب دستور دسِت بیعت کرنا شروع کردیا اور یہ سلسلہ پھر سے جاری

ہوگیا۔ پیر و مرید کی نسبت تازہ ہوئی۔ یہ نسبت بھی عجیب ہے کہ تمام عزیز و اقارب سے زیادہ’ پیر کو مرید سے اور مرید کو پیر
سے پیار و محبت ہوتا ہے۔

شاید حضور سے کوئی نسبت ہمیں بھی ہو
آنکھوں سے جانچ کر ہمیں پہچان جائیے

تعلقات کئی قسم کے ہوتے ہیں، عزیز و اقرباء سے تعلق، دوستوں سے تعلق وغیرہ وغیرہ۔ اس دنیا میں کوئی شئے بھی تعلق
کے بغیر نہیں جیسے کہ اس شعر سے ظاہر ہوتا ہے۔

قات کی غارت گری کا حال نہ پوچھ
تعّل
کہ دن کے ُنور کا بھی رات سے تعلق ہے

لیکن جو نسبت یا جو رشتہ یا جو تعلق شیخ اور مرید کا ہوتا ہے، وہ تمام سے انوکھا اور عجیب ہوتا ہے۔ یہ رشتہ دھاگے
کامل نہ ہو، ایقان خام ہو، خلوِص قلب سے دور ہو تو یہ تعلق کسی
ِن
کی طرح کّچا اور لوہے کی طرح مضبوط ہوتا ہے، یعنی اگر یقی
وقت بھی ٹوٹ سکتا ہے۔ شیخ سے متعلق کوئی ایسی بات سنی جو اپنی دانست میں درست نہیں تو جھٹ اعتراض کر ڈاال۔ جب
مرید کی طرف سے اعتراض ہوگیا تو سمجھیے، یہ رشتہ ٹوٹ گیا۔ جو اس سے نقصان ہوا، معترض ہی کو ہوا، اور اس نقصان کی
:تالفی بہت مشکل ہے کیونکہ حدیِث قدسی کا مفہوم ہے
جو کوئی میرے بندوں پر اعتراض کرے گا، میرے دوستوں کو ستائے گا تو اس کا مطلب ہے کہ وہ میرا دشمن ہے، اور
خبردار! جو خدا کا دشمن ہے، وہ عذاِب شدید کے لیے تیار ہوجائے۔ اس سے معلوم ہوا کہ واقعی یہ نافرمانی قابلِ معافی نہیں لیکن
اگر وہ پھر دل سے جھک جائے اور توبہ خالص کرے تو اللہ تعالٰی درگزر فرما دیتا ہے۔ محبت خالص نہ ہونے کی وجہ سے یہ
تعلق خام دھاگے کی طرح ہے اور اگر ایمان کامل ہو، محبِت شیخ میں سر تا پا غرق ہو تو وہ ایک پہاڑ کی مانند ہے جسے طوفان و
حوادث کا کوئی خوف و خطر نہیں۔ شیخ کے متعلق الکھوں شکوے، کروڑوں گلے یا قابلِ اعتراض باتیں سننے سے اس کے ایمان
زیست نہ اٹھائے، خواہ کتنی
ِم
نیاز کو جھکایا گیا ہو، اسے تا د
ِن
میں رائی برابر فرق نہ آئے گا۔ لٰہذا چاہیے کہ جس جگہ اس جبی
ہی تکلیفیں ، رنج و الم اٹھانے پڑیں، لیکن ایمان کے قدم ڈگمگانے نہ پائیں۔

میں نے رکھ دی ہے جبیں، دیکھ کے ِاک ماِہ جبیں
جھک گئی ایک جگہ پر، تو اٹھاؤں کیسے ؟

آپ نے اپنا کوئی خلیفہ مقرر نہیں کیا۔ اکثر لوگوں نے اس کے متعلق عرض کیا کہ قبلہ آپ ضرور کسی نہ کسی کو خالفت
ِن رسول صلی الله عليه وآله وسلم کی تبلیغ اور زیادہ ہوگی اور لوگوں کو اسالم کے اور خدا تعالٰی

عطا فرمادیں کیونکہ اس سے دی
کے قریب ہونے کا موقع ملے گا لیکن آپ فرماتے کہ یہ گنج ہائے گرانمایہ میں کس کو سونپوں جب کہ کوئی اس قابل ہی نظر نہیں
آتا۔

نبوی جس قدر پھیل سکے، پھیالیا جائے لیکن میری نظروں میں کوئی ایسا شخص
ِن
فرماتے: مجھے تو بے حد شوق ہے کہ دی
نہیں جس کو اس کام پر متعین کیا جائے۔
ہماری نظروں میں تو جناب کی جماعت میں کافی عالم و عامل ہیں لیکن جو کچھ ایک محبوِب خدا ولی الله کی نگاِہ پاک
ہی میں ہر وقت مصروف رہنے کی تاکید فرماتے
ٰل
دیکھ اور سمجھ سکتی ہے، وہ عام نظریں نہیں دیکھ سکتیں۔ آپ ہمیشہ یاِد ا
اور عابدوں کو دیکھ کر بہت خوش ہوتے۔

ِر
اب رشد و ہدایت کی ذمہ داری قبلہ سجادہ نشین حضرت سّید محمد نواز شاہ کو سونپی گئی اور اس تمام ذمہ داری کا با
گراں اب انہیں پر ہے اور یہ خوشی کی بات ہے کہ آپ ان تمام ذمہ داریوں کو خوش اسلوبی سے نبھا رہے ہیں اور باقاعدہ دو

ہی ہوتا ہے۔
ٰل
ا
ِر
وقت قبلہ و کعبہ کی طرح حسِب معمول کچہری میں بیٹھتے ہیں، محفل آراستہ ہوتی ہے، اور ذک
حضرت شیخ فرمایا کرتے تھے کہ میری باتوں کو اپنے دلوں اور دماغوں میں محفوط کر لو، ان باتوں کی گٹھڑیاں باندھ
لو تا کہ میرے بعد تمہارے کام آسکیں۔ اور یاد رکھو کہ یہ درس و تدریس کا سلسلہ گو جاری رہے گا لیکن جو کوشش میں
تمہارے ساتھ کر رہا ہوں اور جس محبت و پیار کے رنگ میں میں تمہیں رکھنا چاہتا ہوں، وہ کبھی نہ پا سکو گے۔
ِر رسولصلى الله عليه وسلمکی کمی
اللہ و ذک
ِر
قبلٔہ ام کی یہ پیش گوئی بالکل صحیح ہے۔ یہ درست ہے کہ آج بھی اس دربار پر ذک

بے کنار اپنی موج میں آتا تھا تو کئی لعل و جواہر

نہیں لیکن یہ سچ ہے کہ وہ بہتات بھی نہیں پائی جاتی۔ جس وقت وہ بح ِر
اپنے دامن سے باہر پھینکتا لیکن یہ حسرت دل میں رہے گی کہ ان جواہرات کا قدر دان کوئی نہ مل سکا۔

ِر جوہر جوہری

زر، زرگر بداند، قد
ِر
ع قد

اب بھی ان شاء اللہ! یہ آستانہ اسی شان و شوکت سے موجود ہے اور یہ ستارہ اب بھی ویسا ہی روشن ہےاور اپنی چمک
دمک سے گمراہوں اور بھٹکے ہوئے لوگوں کو راِہ کج سے ہٹا کر راِہ راست پر النے کے لیے ہر وقت کوشاں ہے اور دعا ہے کہ یہ
آستانٔہ عالیہ اسی طرح قائم و دائم رہے۔ آمین ثم آمین

شیخ و صوفی رند و زاہد پارسا
سینکڑوں ہیں پر کہاں مرِد خدا

مرِد خدا ہونا بہت دور ہے۔ خدا کی مخلوق میں ہزاروں لوگ ہیں جن میں صوفی بھی ہیں، زاہد و پارسا سب موجود ہیں۔
ایسے صاحِب کرامات فقیر بھی ہیں کہ ان کے حاالت و واقعات دیکھ کر، سن کر حیرانی ہوتی ہے لیکن مرِد خدا کا جو لفظ ہے، وہ
اپنے اندر بہت خوبیاں رکھتا ہے اور واقعی یہ منزل، یہ مقام، یہ مرتبہ بہت ہی بلند ہے۔ یہاں یہ ایک حکایت کے ذریعے میں آپ

ِن خدا کس قدر بلند پایہ اور عظیم المرتبت شخصیت ہوتے ہیں۔

پر واضح کرنے کی کوشش کروں گا کہ مردا
حضرت غوث علی شاہ رحمة اهلل عليه قلندر’ پھرتے پھرتے ایک شہر میں پہنچے، رات ہوچکی تھی، ایک مسجد میں آپ
نے قیام فرمایا۔ آپ فرماتے ہیں کہ جب میں مسجد میں پہنچا تو ایک فقیر سے مالقات ہوئی جو لنگوٹی پہنے تھے۔ انہوں نے مجھ
سے مخاطب ہو کر فرمایا کہ میاں غوث علی شاہ! یہ میری لنگوٹی لے جاؤ اور ابھی دھلوا کر لے آؤ۔ میں نے عرض کیا کہ
حضرت! یہ کون سا وقت ہے دھلوانے کا، اس وقت مجھے کون دھو کر دے گا؟ فقیر نے فرمایا کہ شہر کے دروازے سے باہر نکل کر
دیکھ لو، شاید کوئی مل جائے۔ قلندر صاحب فرماتے ہیں کہ میں اٹھا اور اس طرف چل پڑا۔ جب میں شہر کے دروازے کے پاس
پہنچا تو کیا دیکھتا ہوں کہ شہر کے باہر دھوپ چمک رہی ہے اور یہی کوئی آٹھ نو بجے کا وقت ہے۔ خیر میں نے چند قدم آگے
اٹھائے تو وہاں ایک دھوبی گھاٹ نظر آیا۔ بہت سے دھوبی کپڑے دھو رہے ہیں۔ مجھے دیکھتے ہی سب بیک آواز بولے کہ الؤ،
میاں صاحب کی لنگوٹی دھو دیں۔ میں نے ان میں سے ایک کو دی اور دھلوا کر واپس چال آیا۔ پھر جب دروازہ شہر کے اندر
داخل ہوا تو رات کا سماں ہے۔
شہر کے باہر دیکھو تو دن، اندر دیکھو تو رات۔ اسی الجھن میں کہ عجب بات ہے، میں مسجد میں پہنچا۔ فقیر صاحب
بیٹھے تھے، میں نے لنگوٹی انہیں دے دی اور پوچھا کہ صاحب! یہ تماشا کیا ہے جو میری آنکھوں نے دیکھا ہے؟ فرمانے لگے: یہ
تو سوانگ ہیں، تم اتنے کیوں پریشان ہو؟ میں نے کہا: صاحب! یہ تو بہت بڑی کرامت ہے۔ فرمایا: یہ ٹھیک ہے لیکن مرِد خدا ہونا
بڑا دور ہے۔ یہ تو مداری کا تماشا ہے جو ہر فقیر کر لیتا ہے۔ اس حکایت میں گو کسی مرِد خدا کی تعریف تو نہیں کی گئی لیکن
اس سے اتنا پتہ چلتا ہے کہ مرِد خدا کا شان اس سے بھی بلند ہے اور یہی ان کی تعریف ہے، لیکن

شاذ و نادر کوئی شہ باز حالل
کھولتا ہے اس ہوا میں پر و بال

نہانی کو
ِر
قبلہ گاہی میں وہ تمام خوبیاں پائی جاتی تھیں جو کہ ایک مرِد خدا میں ہونی چاہییں۔ یعنی ہمیشہ آپ اسرا
پوشیدہ رکھنے کی کوشش کرتے لیکن ِاسی چھپانے ہی چھپانے میں سب کچھ کہہ جاتے۔
ِر غیب
مرحبا اے خازِن اسرا
کیا چھپایا ہے ہنر کو مثِل عیب

یہاں پہ ایک واقعہ نقل کرتا ہوں جو کہ قبلہ و کعبہ کے مق ِبّر خاص میاں غالم رسول خان ویروآنہ کی وساطت سے مجھ
تک پہنچا۔ میاں غالم رسول جو کہ 1939 ء سے ہی قبلٔہ عالم کی غالمی میں ہیں، بقول ان کے‘‘ مجھے مولوی فضل الحق نے ‘
طب کے ماہر، پیر سّید مہر علی شاہ صاحب رحمۃ اللہ تعالٰی علیہ کے عقیدت مند اور فیض یاب،
ِم
جو کہ قصبہ جکھڑ میں عل
اور مجھ سے کافی مانوس تھے، اپنے پاس بلوا بھیجا۔ چنانچہ بندہ حضرت شیخ سے رخصت حاصل کرکے ان کی خدمت میں
مخفی کے انکشاف کرنے کے لیے بلوایا ہے۔ یہ
ِز
حاضر ہوا۔ لمحاِت فرصت میں مجھ سے مخاطب ہوئے کہ میں نے آج تمہیں ایک را

معرفت عطا فرمایا ہے جس کی
ِم
کامل نے عل
ِخ
بات عام کھولنے کی نہیں لیکن میں تمہیں بتانا مناسب سمجھتا ہوں۔ مجھے شی
روشنی میں’ میں نے تمہارے شیخ کا مقام مالحظہ کیا ہے۔ تمہارے قبلہ و کعبہ کی مثال ایسی ہے جیسے ایک جنگل میں ہزاروں
جانور ہوتے ہیں، لیکن سب کا سردار شیر ہوتا ہے۔ اور پھر ان شیروں میں سے ایک شیر ایسا بھی ہوتا ہے جو ان تمام پر فوقیت
رکھتا ہے۔ تم یقین جانو کہ زمانٔہ حال کے تمام فقراء میں تمہارے شیخ کا مقام بالکل اسی طرح ہے۔ میں تمہیں انس و شفقت کی
وجہ سے بتا رہا ہوں اور یاد رکھو، اپنے شیخ کو کبھی نظ ِر غیر سے نہ دیکھنا۔ خیر میں وہاں سے فارغ ہوکر آستانٔہ عالیہ پر
پہنچا۔ مرشدی و موالئی کچہری میں رونق افروز تھے۔ فرمایا: کیا کہا ہے فضل الحق نے؟ بندہ نے تمام عرض کیا جو سنا تھا۔

مخفی اس طرح بیان کرتا رہے۔ پھر حضور خاموش ہوگئے۔
ِز
فرمانے لگے: اسے کیا حق پہنچتا ہے کہ کسی کا را

تو نہ تھا کچھ عین، عین اللہ تھا
ظاہًرا بندہ، نہانی شاہ تھا
بندگی کے بھیس میں اے جامٔہ زیب
دے گیا واللہ تو سب کو فریب

مرِد خدا کی حقیقت بیان کرنا بڑی ہی مشکل بات ہے اور نہ ہی ہوسکتی ہے۔ لٰہذا میں اپنے انہی الفاظ پر ختم کرنا چاہتا ہوں۔
ہر مسلمان کو ایسی نظریں نصیب فرمائے جو مرِد حق شناس کی شناسا ہوں

اور ساتھ ہی یہ دعا بھی کرتا ہوں کہ خدا تعالٰی

دارین ہے۔ آج کل ایسے لوگ بھی
ِح
کیونکہ انہیں کی پہچان سے حق کی پہچان ہوسکتی ہے، اور انہی کے نقِش قدم پر چلنے سے فال

ِن خدا پر کیچڑ اچھالنے کی کوشش کر رہے ہیں مگر ان

ہدایت کو بجھانے کے درپے ہیں۔ ان مردا
ِع
پیدا ہوچکے ہیں جو اس شم
لوگوں کے بنائے کچھ نہ بنے گا۔
الله تعالٰی اور اس کے رسوِل مقبول صلی الله عليه وآله وسلم کا نام ہمیشہ سے بلند ہوتا رہا ہے اور تاابد بلند ہی رہے گا۔

َباَلُغ
ْل
ْیَنا ِااَّل ا
َو َما َعَل
سّید محمد ظفر قادری رحمة اهلل عليه

''';
  static const String qalbeSaleemLongText = """
قلِب سلیم کا لغوی معنی ہے ایسا دل جو

محفوظ
ے
ہر قسم کی بیماری اور عارضہ س

مراد ایسا
ے
ہو ، تاہم اصطالح میں اس س

ے
سوا کسی چیز س
ے
دل ہے ، جو اسالم ک

ے اس کی مختلف

آشنا نہ ہو۔ مفسرین ن
تعریفیں کی ہیں ، امام قرطبی رحمة اهلل

ے ہیں

:عليه لکھت

۔ حضرت سعید بن المسیب رحمة اهلل1
مراد صحیح
ے
فرمایا: قلب سلیم س
ے
عليه ن

کیونکہ کافر اور

دل ہے جو مومن کا دل ہے
منافق کا دل مریض ہوتاہے ۔

۔ حضرت ابو عثمان سیاری نیشاپوری2
فرمایا: قلب سلیم اس کا
ے
رحمة اهلل عليه ن

خالی ہو اور سنت پر
ے
ہے جو ہر بدعت س
قائم ہو۔

۔ حضرت امام حسن بصری رحمة اهلل3
مراد وہ دل
ے
فرمایا: قلبِ سلیم س
ے
عليه ن

خالی ہو۔
ے
ہے جو مال اور اوالد کی آفت س

۔ حضرت شیخ جنید بغدادی رحمة اهلل4

ے
فرمایا : یہاں سلیم ‘‘لدیغ’’ ک
ے
عليه ن
معنی میں استعمال ہوا ہے یعنی وہ شخص

جس کا دل ہمہ وقت خشیتِ اٰلہی میں
مستغرق ہو ۔ )1(

مراد5
ے
۔ ایک قول یہ ہے : قلبِ سلیم س
وہ دل ہے جو گمراہی ، بدعت ، غفلت ،
عدم حضوری ، حجابات ، خواب گاہ ،

ے
مسکن و رہائش اور مدح و مالمت س

لیے
ے
صحیح و سالم ہو، یہ امور سالکین ک

ے
ے ہیں جب کہ کاملین ان س

آزمائش ہوت

ے ہیں۔ )2(

محفوظ و مامون ہوت

ے دن قلبِ سلیم یعنی

جو شخص قیامت ک
دنیا کی لذتوں ، رغبتوں، چاہتوں اور
کنارہ کش دل ، دنیا کی
ے
شہوتوں س

ے پاک دل ، اهلل

آرزوؤں اور خواہشوں س

ے
ے ذکر اور اس کی محبت و معرفت س
ک

گا تو یہی قلبِ سلیم
ے
کر آئ
ے
معمور دل ل
اس کو نفع دے گا۔ جیساکہ اهلل رب العزت
قرآن مجید میں ارشاد فرمایا
ے
:ن

ْوَن
ُن
ْن َفُع َماٌل َّواَل َب

َه oَیْوَم اَل َی
ّٰل
َتى ال

ِااَّل َمْن َا

۔ )3(
ٍم
ٍب َسِلْي
َقْل

ِب

ے ) ‘‘

دن نہ ) کسی کو ( مال نفع ( قیامت ک

ے اهلل کی راہ

مگر ) اس

دے گا اور نہ بیٹے

ے
نفع دیں گ

میں خرچ کیا ہوا مال اور بیٹے

کر
ے
ے ( سالمت دل ل

( جو ) کفر و شرک س

’’اهلل کی بارگاہ میں حاضر ہوا ۔

مراد محض گوشت کا لوتھڑا
ے
قلب س

میں ہے اور انتقالِ
ے
نہیں جو ہمارے سین

ے اند ر

خون کا باعث بنتاہے ، بلکہ اس ک
روحانی کیفیات ہیں جو اس دل کا مرکز
ے بارے میں اهلل رب العزت کا

ہیں جس ک
: ارشاد گرامی ہے

ِئَک َکاَن
ٰٓل

و
ُا
َؤاَد ُکُّل
ْلُف
َبَصَر َوا
ْل
ِاَّن الَّسْمَع َوا

ُه َمْسُئْواًل۔ )4(
ْن
َع

شک کان اور آنکھ اور دل’ ان سب‘‘
بے

گا۔
ے
ے دن ( پوچھا جائ

ے ) قیامت ک
’’س

جسم انسانی میں ہر عضو کا ایک خاص
کام ہے ۔ اگر وہ عضو صحیح کام کرے تو
کہ وہ صحت مند ہے، اور

اس کا مطلب ہے
اگر وہ اپنا کام نہ کرے تو بیمارہے ۔ اسی
طرح دل کا بھی اپنا ایک مخصوص کام ہے۔
لیے پیدا
ے
جسمانی دل خون کی سرکولیشن ک
کیا گیا ہے جب کہ قلبِ روحانی کو چار قسم
ے امور الزم ہیں
:ک

ے رسول صلی1

۔ وہ دل الله تعالٰی اور اس ک

ے بڑھ کر

سب س
ے
الله عليه وآله وسلم س

محبت کرے۔
۔ وہ دل الله تعالٰی کی طرف رجوع اور2

توبہ کرے۔
ے
گناہوں س
۔ وہ دل الله کریم کی مالقات کا شوق اور3
اس کی رغبت رکھے ۔
۔ وہ دل الله رب العزت کی معرفت حاصل4
کرے۔

روحانی دل ان چار مقاصد کی خاطر
زندگی کی تمام شہوتوں اورخواہشات کو
لیے پیدا کیا گیاہے۔ جس طرح
ے
ک
ے
قربان کرن
جسم کو صحیح، صحت مند اور طاقتور
مادی خوراک کی ضرور ت
لیے
ے
ک
ے
رکھن
ہوتی ہے ، اسی طرح دل کو بھی صحت مند

لیے روحانی خوراک کی
ے
ک
ے
و توانا رکھن
ضرورت ہوتی ہے اور وہ الله تعالٰی کا ذکر
ہے۔ روحانی دل کی خوراک و غذا ء محبت
اٰلہی عزوجل اور محبت رسوِل کریم صلی

ے
الله عليه وآله وسلم ہے اور الله تعالٰی س
مالقات کا شوق دل کی حیات ہے۔شوق لقاء
تو یہ دل کی راحت
ے
میں اگر دل کو لذت مل
ہے ، اگر اس خواہشِ دیدار کی کیفیت میں
تو ایسا دل قلبِ
ے
دل کو راحت و سرور مل

غافل
ے
سلیم ہے جو کبھی الله کی یاد س
نہیں ہوتا اور ہر وقت یاِد اٰلہی میں

ے
مستغرق رہتا ہے۔ دل کو صحت مند کرن

لیے
ے
ک
ے
ے درجہ پر فائز کرن

اور قلِب سلیم ک
ہمیں ان لوگوں کی صحبت و معیت اختیار

کا حکم دیا گیا ہے جو لوگ قلِب سلیم
ے
کرن

ے
ے دلوں س

ے ہیں۔جن لوگو ں ک

رکھت
غفلت کا پردہ اٹھ جاتا ہے ، ان کو الله کریم
کی قربت اور ہم نشینی نصیب ہو جاتی ہے ۔

ے ہیں

: موالنا روم رحمة اهلل عليه فرمات

ہر کہ خواہد ہم نشینی با خدا
او نشیند در حضوِر اولیاء

’’
کہ وہ اهلل کریم کی

جو شخص چاہتا ہے

کہ وہ

ے چاہیے

معیت اختیار کرے تو اس
’’اولیاء اهلل کی صحبت میں بیٹھا کرے ۔

ے دن اهلل والوں کی محبت و

قیامت ک

گی ۔ قرآن مجید میں اهلل رب
ے
رفاقت کام آئ

فرمایا
ے
:العزت ن
َا َاْلِخآَّلُء َیْوَمِئٍذ َبْعُضُهُمْ ِلَبْعٍض َعُدٌّو ِااَّل

ُمَّتِقْیَن ۔ )5(
ْل
ا

’’
ے
اس دن گہرے دوست ایک دوسرے ک

مگر پرہیزگار )مسلمانوں
ے
دشمن ہوں گ
ے درمیان دینی محبت و دوستی قائم رہے
ک

’’گی ( ۔

امام االولیاء حضر ت پیر سید محمد
عبداهلل شاہ مشہدی قادری رحمة اهلل عليه
عظیم المرتبت انسانوں
ے
ایس
ًا
بھی یقین

ے
تھے جو قلبِ سلیم ک
ے
میں س

قلوب پر انوارو تجلیات
ے
ہیں اور جن ک
اٰلہیہ کا مینہ چھم چھم برستاہے۔ آپ رحمة
اهلل عليه کی حیات طیبہ کا ہر لمحہ یاِد
گزرتا تھا ،
ے
ے ہوئ

اٰلہی میں مستغرق رہت
سنتِ رسول مکرم صلی الله عليه وآله وسلم
عمل پیرا تھے، حلقٔہ ارادت
ے
پر سختی س
میں شامل احباب کو اولیاء اهلل کی صحبت
ے رہنا تو گویا آپ رحمة اهلل

کا محبوب عمل تھا۔ آپ رحمة اهلل

ے
ے ان نفوس قدسیہ میں س

عليه اهلل کریم ک

لیے
ے
تھے جن کا وجود مسعود امت ک

لیے
ے
بالعموم اورمریدین و معتقدین ک

کم
ے
بالخصوص کسی نعمت عظمٰی س

نہیں۔ اهلل تعالٰی ہم سب کو قلبِ سلیم عطا
حاملین صوفیاء
ے
ے اور قلبِ سلیم ک

فرمائ

ے ۔امین

کرام کی صحبت و برکات عطا فرمائ

سّید محمد فراز شاہ مشہدی قادری عفی
عنہ""";

  static const String alFiraq = """
حضرت شیخ قّدس سّرہ العزیز
ِر خوش الحان خاموش ہیں چمن میں
کیوں طائ
افسردگی سی کیوں ہے، پھولوں کی انجمن میں
یہ چمن کو کیا ہوا ہے کہ بہار میں خزاں ہے
لوں میں، نہ وہ حسن یاسمن میں

نہ مہک ہے وہ ُگ
فصِل بہار گزری، دن آ گئے خزاں کے
آُہو اب کہاں ہے، کہاں مشک اب ختن میں
ِم
ر
ہمدم یہ کس کے غم میں د یوار و َدر ہیں گریاں
عرش و فرش ہیں لرزاں، شیون ہے انجمن میں
آہ! کس نے اب جہاں سے رخِت سفر ہے باندھا
اقبال و بخت و دولت سب آ گئے گہن میں
نور افشاں! تجھ کو خبر نہیں کیا
ِع
!اے شم
بے آسرا ہیں راہی، رین آ گئی ہے َبن میں

ہر چند میں نے ڈھونڈا لیکن کہیں نہ پایا
نظر، کہ حاصل تھا، تیری انجمن میں
ِق
ذو
الکھوں حسین دیکھے لیکن نظر نہ آئی
وہ ادائے دلنوازی، جو تھی تیرے بانکپن میں
کی آرزو ہے رہے تا ابد میّسر
یہ ظفؔر

تر گئی تھی َمن میں

وہ نگاِہ لطف و احساں، جو ُا

(سّید محمد ظفر قادری رحمة اهلل عليه)""";

  static const String izharTashakkorLongText =
      """کتاب ‘‘قلبِ سلیم’’ امام االولیاء حضر ت پیر سّید محمد عبداهلل شاہ مشہد ی قادری رحمة اهلل عليه کے بے شمارمواعظ
ملفوظات سے ُمشتے ازخروارے )نمونہ( کے طور پر ہے جسے1961 ء میں آپ رحمة اهلل عليه کے وصال پر مالل کے بعد حضور نا
جہاں، بانی حزب الرحٰمن حضرت پیر سّید محمد نواز شاہ مشہدی قادری رحمة اهلل عليه سجادہ نشین آستانہ عالیہ قادریہ کے حکم
نگرانی حضور امام
پر صاحبزادہ واال شان، پیک ِر سوز و گداز حضور سّید محمد ظفر شاہ مشہدی قادری رحمة اهلل عليه کی زیرِ
االولیاء رحمة اهلل عليه کے ایک مریدِ خاص محترم جناب صوفی عبدالحمید قادری صاحب نے انتہائی خلوص اور جانفشانی کے ساتھ
ترتیب دیا۔مگر اس میںآیات قرآنیہ، احادیث طیبہ، فارسی اشعار کے تراجم ،تخریج، حوالہ جات اور شجرٔہ مبارکہ کی اصالح جیسے
اہم امور تشنٔہ تکمیل تھے ۔
قارئین کرام! آج مجھے قلبی مسرت ہو رہی ہے کہ رِّب کائنات کے خصوصی فضل وکرم سے، حضور خاتم المرسلین صلی الله
عليه وآله وسلم کے طفیل، امام االولیاء حضر ت پیر سّید محمدعبداهلل شاہ مشہد ی قادری رحمة اهلل عليه کے مواعِظ حسنہ جو کہ
شریعت ، طریقت اور معرفت کے خزائن و اسرار کا مجموعہ ہیں، جنھیں تحقیقی معیار کے مطابق پیش کرنے کی سعادت حاصل
کر رہا ہوں۔ حدیث مبارک ہے
َهلل
ا
ِر
ْم َيْشُك
الَّناَس َل
ِر
ْم َيْشُك
َمْن َّل
(الجامع السنن للترمذی /3 403)
’’جس نے لوگوں کا شکریہ ادا نہ کیا’ اس نے اللہ تعالٰی کا شکریہ بھی ادا نہیں کیا۔ـ ‘‘
چونکہ تصنیف و تالیف کا کام نہایت ہی محنت و عرق ریزی کے بجز ممکن نہیں ، بطورِ خاص مشائخ کرام کے ملفوظاِت
واال شان کی
ِر
شریفہ کی ترتیب میں کئی مشکل مراحل سے گزرنا پڑتا ہے ۔ قارئین کرام کو مطالعہ کرنے سے معلوم ہو گا کہ حضو
ہر مجلس قرآنی آیات و احادیث مبارکہ سے مزین ہوتی تھی، پھر ان سے استدالل و استخراج نہ صرف علم ظاہری بلکہ علم لدنی
تبلیغ اور حروف کا چناؤ نہایت سادہ ، سلیس اور عام فہم
ِز
کا سرچشمہ اور منہ بولتا ثبوت ہے ۔ چونکہ آپ رحمة اهلل عليه کا اندا
تھا اس لیےآپ رحمة اهلل عليه کے ملفوظات سے خواندہ و ناخواندہ، دانشوران اور علماء برابر مستفید ہوا کرتے۔ایسے معارف کو آپ
دین کے اقوال و حکایات کے حوالہ جات اور تخریج و
ِن
حضرات تک پہنچانے کے لیے آیاِت قرآنیہ و احادیث مبارکہ اور بزرگا
تصحیح کے مشکل کام میں مجھے کئی ارباِب علم و دانش کی معاونت حاصل رہی ۔
کتاِب مستطاب میں حوالہ جات کی تحقیق و تخریج، حواشی، اغالط کی درستی ، عربی عبارات پر اعراب اور ان کے تراجم
، فارسی اشعار کا ترجمہ ، ان تمام امور میں “ادارہ تحقیقاِت نواز” کے تحت الہور سے مفتی غالم سرور قادری صاحب، مفتی حافظ
محمدندیم رّبانی صاحب، حزب الرحٰمن اسالمی اکادمی سے شیخ الحدیث والتفسیر مفتی غالم محمد سعیدی صاحب ، مفتی محمد اعظم
اکبری صاحب، موالنا حاجی فضل کریم صاحب، مفتی محمد فیضان قادری صاحب، مفتی محمد شاکر قادری صاحب، موالنا اعجاز
احمد قادری صاحب، سّید وسیم احمدشاہ صاحب، محمد رمضان قادری صاحب، موالنا عبدالرشید باروی صاحب، موالناسّید بالل
حسین شاہ قادری صاحب، موالنا نّیر عباس قادری صاحب، موالنا شوکت بشیر قادری صاحب، موالنامحمد آصف قادری صاحب ،
محمد عمران قادری صاحب اور عمران فاروق قادری صاحب نے حسب استعداد انتہائی محنت و اخالص سے اپنی خدمات سرنجام
دیں۔
ورق کی تزئین میں محترم عرفان اکبر قادری صاحب نے اپنی خدمات پیش کیں’کمپوزنگ کے امور مفتی حافظ محمد
س ِر
ندیم ربانی صاحب، قاری مزمل حسین قادری صاحب، جمیل احمد نقشبندی صاحب ،محمد الطاف قادری صاحب اور محمد عاصم
صاحب نے جبکہ طباعت کے جملہ مراحل میاں غالم محمد سرگانہ صاحب ،محترم محمد شفیق قریشی صاحب اور نجم الثاقب
احسن سرانجام دیے۔
ِق
قریشی صاحب ایشین آرٹ پریس الہور نے نہایت ہی عقیدت و محبت سے بطری
دیگر کئی حضرات جن کا نام نہیں لیا گیا ،میںان تمام احباب کا صمیمِ قلب سے شکر گزار ہوںاور دعا گو ہوں کہ اللہ
تعالٰی انھیں اس جلیل القدر کاو ش پر اج ِر جزیل عطافرمائے۔آمین
ع گر قبول افتد’ زہے عزو شرف
اعتزار
!گرامی قدرقارئین
انسان کو الله تعالٰی نے بے پناہ علوم وفنون سے نوازا ہے اور اصحاب علم ودانش میں درجات بھی بجا ہیں
ٍم َعِلْیٌم
ِذْی ِعْل
َوَفْوَق ُک ِّل
اور ہر علم والے سے اوپر سب سے زیادہ علم واال ہے’’ )سورہ یوسف 72( ‘‘
اس کی خوب صورت شہادت ہے اس لیے صاحبان قرطاس وقلم سے گزارش ہے کہ اگر اس کتاب میں کسی حوالے سے کمی محسوس
ہو تو ہمیں ضرور آگاہ کریں تاکہ نئے ایڈیشن میں اسکی اصالح کی جاسکے۔
خیر اندیش
سید محمد فراز شاہ عفی عنہ""";

  static const String pesheLafazLongText = """لفظ

کو سزاوار ہے جو محمود ہے ہر حامد کا اور معبود ہے ہر عابد کا۔ تمام بڑائیاں،
ٗہ
الشریک ل
ٗہ
سب حمد و ثناء اسی ذاِت وحد
سب بزرگیاں اور تمام عّزت اسی کے لیے ہے اور کبریائی صرف اسی کو زیبا ہے۔ نہیں ہے اس سے بڑھ کر یا اس کے برابر اور ہم
کل شئے اور احسن الخالقین ہے کہ جس نے نہایت
ِق
مثل کوئی شئے، وہ واحد الوجود ہے اور کوئی اس کا غیر موجود نہیں۔ وہ خال

محمد صلی الله عليه وآله وسلم کو ظاہر کیا اور اس ُنور سے تمام کائنات کا ظہور فرمایا۔
ِر
وجود سے ُنو
ِر
محبت کے ساتھ اپنے ُنو
ذاِت محمد صلی الله عليه وآله وسلم کو تمام مؤمنوں، متقیوں، عابدوں، زاہدوں، عارفوں، صالحین، صادقین، اور جملہ
ِر
پھر ُنو
فقراء، اغنیاء و اولیاء کا مرکز اور قبلہ مقّرر فرمایا۔ اس ذاِت پاک کے احسانات کی شکر گزاری کے لیے مجھ ایسے خطاکار اور ہیچ
درماندگی و بے چارگی کے کچھ بھی نہیں ہے۔ یہ اس کی کتنی بڑی عنایت اور بندہ نوازی ہے کہ اس
ِر
مدان کے پاس سوائے اظہا
نے بکماِل شفقت حضور مرشدنا و مولٰینا، امام االولیاء، حضرت سّید محمد عبد اللہ شاہ مشہدی قادری رحمۃ الله تعالٰی علیہ کے
ملفوظات کی ترتیب کی خدمت سے مجھے نوازا اور اس ذّرٔہ بے مقدار کو ان کی تکمیل کی توفیق عنایت فرمائی۔
حضور کی مجالس کا تذکرہ مجھ ایسے پس ماندہ طالب علم اور ایک ادنی غالم کے لیے کوئی معمولی کام نہ تھا۔ حضور
کی ظاہری حیاِت احسن صفات میں کاش کہ آپ کے مواعظ حسنہ کو کوئی مرِد خدا اس نّیت سے باقاعدہ معرِض تحریر میں التا
محبت کی کسی قدر تسکین کا موجب بن سکے جو حضورکی پردہ پوشی کے بعد ان کے
ِن
کہ یہ مبارک کالم ایک دن ُان تشنہ کاما
مبارک لبوں سے نکلے ہوئے ایک ایک لفظ کے لیے ترسیں گے اور جب ان کی روحیں اس محبوب راہنما کی یاد میں تڑپیں تو یہ

عیسٰی ثابت ہو۔
ِم
کالم ان کے زخمی دلوں کے لیے د

چہ ساز بود کہ در پردہ می زد آں مطرب
کہ رفت عمر ہنوزم دماغ پر ز ہوا ست

وہ ساز کیسا تھا جسے اس )خالق حقیقی( ساز بجانے والے نے پردہ میں ُچھپ کر یوں بجایا کہ زندگی گزر گئی لیکن آج اور اب ‘‘

’’بھی میرے دل و دماغ ُاس کی کشش سے مہک رہے ہیں۔

حضور مرشدنا و موالنا قّدس سّرہ العزیز کی حیاِت مبارکہ میں ہمارا یہ حال تھا کہ کشمِش حیات سےاکتا کر معروضات کا
پشتارہ اٹھائے جب خدمِت عالیہ میں پہنچتے تو آپ ایک ہی نظر میں تمام کیفیات سے آگاہ ہوجاتے، پھر زندگی کی ان الجھنوں
کو اس طرح صاف فرماتے جاتے کہ دل و دماغ پر کلفتوں کے چھائے ہوئے گرد و غبار غائب ہوجاتے۔ شرم و ندامت سےآنسوؤں کی
ایسی جھڑیاں لگ جاتیں جو دلوں پر چھائی ہوئی کدورتوں کو دھو کر انہیں صاف کردیتیں۔ پھر لطف یہ ہے کہ ہماری دلی
کیفیتوں سے متعلق کالم فرمائے جا رہے ہیں مگر مخاطب کسی اور صاحب سے ہیں اور ہمیں یہ محسوس نہیں ہونے دیتے کہ در
ِم
اصل روئے سخن ہماری جانب ہے۔ اسی طرح ہر شخص کی پردہ پوشی فرماتے، براِہ راست کوئی حکم صادر نہ فرماتے تا کہ عد
ِم
گراں نہ بنے۔ حضور کے وصال پر ہر خاص و عام کا یہ حال تھا کہ سوائے غ
ِر
تعمیل کی صورت میں طالبوں کی گردنوں پر با
جاناں کے کوئی تذکرہ نہ تھا۔ جدھر نظر اٹھتی، غم و اندوہ کے سائے نظر آتے۔ ہر آنکھ اشکوں کا طوفان لیے ہوئے اور ہر لب پر
آِہ سوزاں رقصاں تھی۔ ہماری اگر کوئی آرزو تھی تو صرف یہ کہ وہ میٹھی میٹھی پیاری پیاری زبان اور سادہ سادہ
تشبیہات کے پردہ میں حق کی مترنم آواز اسی سادگی اور دلفریبی کے انداز میں کبھی تو گوِش جان پر وارد ہو، کبھی تو وہ
دل نواز جس سے عقل و جان کے عقدے
ِز
آواز خرد کی تنگ دامانی پر بجلی بن کر گرے اور روح کو بے تاب کردے۔ ہاں! وہی آوا
کھلتے تھے اور روح کی بے تابیوں کو فروغ ملتا تھا، پھر ل ِتّذ سماعت پیدا کردے۔
ِم صبح گاہی
ہمہ شب دریں امیدم کہ نسی
آشنایاں بنوازد آشنا را
ِم
بہ پیا

میں نے پوری رات اس امید میں گزار دی کہ صبح کے وقت مشرق سے چلنے والی ٹھنڈی ٹھنڈی ہوا عاشق کو اپنے معشوقوں کے ‘‘

’’پیغام دلنواز سے نوازے گی۔

آخر کار جب کچھ دن گزرے اور طبیعت کسی قدر سنبھلی تو خیال آیا کہ اگرچہ اس طائر عرش آشیاں اور طوطٔی
شیریں بیاں کی مترنم صدائے حق سے ہمارے ظاہری کان پھر آشنا نہ ہوسکیں گے تاہم اگر حضور کے ملفوظات کو محفوظ کرنے

کوئے دوست کی کسی قدر تسکین کی صورت نکل آئے گی۔
ِن
کی کوئی صورت پیدا ہوجائے تو رہروا

پھر چاہتا ہوں نامٔہ دلدار کھولنا
جاں نذر دلفریبی عنواں کیے ہوئے
ِر طریقت اس خدمت پر مامور تھے۔ چنانچہ حضور کے اس ادنی غالم نے قبلہ و

حضور کی حیاِت با برکت میں ہی ایک براد

ِن حضرت
کعبہ حضرت سّید محمد نواز شاہ صاحب )سجادہ نشین( اور حضرت سّید محمد ظفر شاہ صاحب قبلہ ) صاحب زادگا

نا( کی خدمت میں ان ملفوظات کی ترتیب کے لیے عرض کیا۔ جواب مال: جو صاحب اس کام پر مامور تھے، ان سے تو

مرشدنا و مولٰی
کچھ حاصل نہیں ہوسکا تاہم کوشش کریں گے کہ الله تعالٰی اس کی کوئی بہتر صورت پیدا فرمادے۔ چنانچہ آپ حضرات کی
بے دام کو انہیں باقاعدہ ترتیب دینے کی
ِم
مساعٔی جمیلہ سے الحمد الله کہ تین مسّودے میّسر آگئے جو آپ نے بکماِل مہربانی اس غال
غرض سے بھجوادیے۔ ان حضرات کی اس کرم نوازی کے لیے بے حدممنون ہوں اور پرامید ہوں کہ اس حیاِت مستعار میں اور اس
کے بعد بھی ان کی کرم فرمائیاں شامِل حال رہیں گی۔
: جن حضرات سے مسّودے وصول ہوئے ہیں، ان کے اسماِء گرامی یہ ہیں
۔ ماسٹر عبد العزیز صاحب۔1
۔ مولوی نور الحق صاحب۔2
۔ جناب انور علی شاہ صاحب۔3
ان مسّودوں کی مجموعی کیفیت یہ تھی کہ وہ کتابی صورت میں النے کی غرض سے نہیں لکھے گئے تھے بلکہ ان
کے مواعِظ حسنہ کے مختصر نوٹ لے
ٗہ
صاحبان نے اپنے ذاتی ذوق و شوق کی تسکین کے لیے حضور مرشدنا و موالنا نّور اللہ مرقد

نظر ملفوظات کی ترتیب میں اصل مسّودوں
ِر
رکھے تھے جن میں کہیں اختصار تھا تو کہیں وضاحت بھی تھی۔ چنانچہ زی
سے حتی االمکان ہٹنے کی کوشش نہیں کی گئی، البتہ انہیں حضرِت شیخ کے اسلوِب بیان کے مطابق ترتیب دینا حضرت قبلہ و کعبہ
کی تائیدِ غیبی کے سوا ناممکن تھا۔ یہ حقیقت ہے کہ بعض مقامات پر باوجود دلی رغبت کے دو ہفتےقلم ہاتھ میں لیے بیٹھا رہا اور
ایک لفظ بھی نہ لکھ سکا۔ پھر جب وجدانی کیفیتیں ساتھ دینے لگتیں تو قلم کی روانی مسلسل جاری رہتی۔ چنانچہ نہ تو یہ
نفسی کہ حضور کے ملفوظات کو بالکل صحیح صورت میں محفوظ کرنے میں کامیاب ہوا اور نہ ہی اس میں کوئی نکتہ چینی
ملی۔ لیکن خواہش ہے کہ کوئی کیمابری کی سچائی کچھ بھی نہ پایا۔ یہ کوئی عذر نہ ہوگا بلکہ حضور کے سلسلے میں اس کی
محبت اور غم کی عمدہ دُعا ہوگی۔ میں اتمام شکر گزاری کے ساتھ اختتام کرتا ہوں اور اللہ تعالٰی کی بارگاہ سے قبولیت کی دُعا
کرتا ہوں کہ اپنے محبوب مرشد و پیر، حضرت سید محمد عبد اللہ شاہ مشہدی قادری رحمۃ الله تعالٰی علیہ کے صدقے ہم سب کو
زندگی کی ہدایت عطا فرمائے، دنیا اور آخرت میں اپنے لطف و کرم سے ہم سب کی رہنمائی فرمائے، اور اس کی تقصیر و
کوتاہیوں کو معاف فرمائے۔ آمین ثم آمین""";
  static const String muqadimaAlkitabLongText = """
از رشحاِت قلم: حضرت ابو الحقائق پیر سّید امانت علی شاہ چشتی نظامی رحمۃ الله تعالٰی علیہ

بیت االمان مغلپورہ گنج، لاہور

مدینہ جناب محمد رسول الله صلی الله عليه وآله وسلم نے ارشاد فرمایا کہ میری امت میں بہتر فرقے پیدا ہوں گے۔ ان میں سے صرف ایک فرقہ ناجی ہوگا، باقی سب جہنمی ہوں گے۔ صحابہ کرام رضوان اهلل علیہم اجمعین نے حضور نبی کریم صلی الله عليه وآله وسلم سے دریافت کیا: وہ ناجی فرقہ کون سا ہوگا؟ تو حضور نبی کریم صلی الله عليه وآله وسلم نے ارشاد فرمایا:
جس پر میں اور میرے صحابہ کرام رضوان اهلل علیہم اجمعین ہوں گے۔

حضور نبی کریم صلی الله عليه وآله وسلم کے ارشاد کے مطابق بہتر فرقے پیدا تو ہوچکے ہیں مگر ان میں سے ہر ایک فرقہ اپنے آپ کو ناجی ہونے کا مدعی ہے۔ تمام فرقے اگر ناجی ہیں تو حضور نبی کریم صلی الله عليه وآله وسلم کے ارشاد کے مطابق تمام فرقے جہنمی ہوں گے، صرف ایک فرقہ ناجی ہوگا۔ اس کا کیا ثبوت ہے کہ وہ کون سا فرقہ ہے جو ناجی ہے؟ جب تک اس کا کوئی معیار قائم نہ ہو، اس وقت تک اس کا فیصلہ محال ہے۔

حضرت عمران بن حصین رضي الله عنه سے مروی ہے کہ حضور نبی کریم صلی الله عليه وآله وسلم نے ارشاد فرمایا ہے:
سب سے بہتر زمانہ میرا ہے، اور اس کے بعد صحابہ کرام رضوان اهلل علیہم اجمعین کا، اور پھر اس کے بعد صحابہ کرام رضوان اهلل علیہم اجمعین کے ملنے والے تابعین کا، اور اس کے بعد ان تابعین کے ملنے والوں کا۔

جب تک صحابہ کرام رضوان اهلل علیہم اجمعین کے ملنے والوں کا زمانہ رہا، حدیث کے جمع کرنے کی ضرورت محسوس نہ ہوئی۔ حضور نبی کریم صلی الله عليه وآله وسلم کے ڈیڑھ سو سال بعد مجتہدین کا زمانہ آیا۔ زمان و مکان اجازت دیتے تھے، حدیث جمع ہونی شروع ہوئی۔ محّدثین کرام نے حدیث کے جمع کرنے میں سعی بلیغ سے کام لیا اور روایات کو حضور نبی کریم صلی الله عليه وآله وسلم تک پہچانے کی کوشش کی۔ روایات کے سلسلہ میں اسماء الرجال قائم ہوئے جس سے حدیث کے صحیح اور غلط ہونے کا معیار قائم ہوا۔

اب چونکہ اس دور میں زمان و مکان بوجِہ ُبعِد زمانہ اجازت نہیں دیتے کہ کوئی بات حضور صلی الله عليه وآله وسلم تک پہنچائی جاسکے۔ ُبعد اور دوری کی وجہ سے اگر آج کسی بات کو حضور نبی کریم صلی الله عليه وآله وسلم تک پہنچانا ہو تو سوال یہ ہے کہ کوئی ایسے ذرائع جو نہایت معتبر اور مستند اور قابلِ قبول ہوں، تلاش کیے جائیں جس سے معیار قائم ہوسکے کہ ہمارا مذہب وہی ہے جو ‘‘بی ’’ کے معیار پر پورا اترتا ہے، اور مذہب کی روایت کو نہایت معتبر، مستند اور قابلِ قبول ذرائع سے حضور نبی کریم صلی الله عليه وآله وسلم تک پہنچا دے۔

حضرت شیخ اکبر محی الدین ابن عربی رحمة اهلل عليه نے اپنی کتاب ‘‘فصوص الحکم’’ میں ارشاد فرمایا کہ محروسٔہ مدینہ حضرت محمد رسول الله صلی الله عليه وآله وسلم کے دسِت مبارک میں ایک کتاب تھی، آپ صلی الله عليه وآله وسلم نے فرمایا کہ یہ کتاب ‘‘فصوص الحکم’’ ہے، اس کی اشاعت کرو۔ چنانچہ وہی کتاب جو حضور نبی کریم صلی الله عليه وآله وسلم کے دسِت مبارک میں تھی، القائے نبوی سے لکھی اور اپنی طرف سے اس میں ایک لفظ بھی نہیں لکھا تو ثابت ہوا کہ حضور نبی کریم صلی الله عليه وآله وسلم سے براِہ راست کتاب حاصل کی گئی تو ایسی مرفوع متصل روایت میں کیا شک ہوسکتا ہے۔

اسی مثال سے تمام اولیاء اللہ والیت کے واسطہ سے جو مذہب بھی اختیار کیا ہے، وہ وہی ہے جو ‘‘بی ’’ سے واضح ہوتا ہے۔ اب تمام مذاہب کو جو ناجی ہونے کے مدعی ہیں، اسی معیار پر پرکھا جائے۔ جو اس ‘‘بی ’’ کا مصداق ہے، وہی ناجی فرقہ ہے۔ یہ دلیل روشن کی طرح واضح ہے کہ اگر اولیاء اللہ معاذ اللہ جہنمی ہیں تو وہ مذہب پر پورا اترے، وہی ناجی فرقہ ہے۔ یہ دلیل رو فرقے جن میں والیت کا دروازہ ہی بند ہے اور ان میں کوئی ولی یہ پیدا ہوا ہے اور نہ پیدا ہوگا، کیسے ناجی ہونے کے دعویدار ہوسکتے ہیں؟

یہ صحیح ہے کہ اولیاء اللہ ناجی ہیں کیونکہ کوئی والیت کے درجہ تک نہیں پہنچ سکتا جب تک اس کا مذہب حضور نبی کریم صلی الله عليه وآله وسلم اور صحابہ کرام رضوان الله تعالٰی علیہم اجمعین تک نہ پہنچتا ہو، اور جو معیار ‘‘بی ’’ کا حضور نبی کریم صلی الله عليه وآله وسلم نے قائم فرمایا تھا، اس پر ہر زمانہ میں وہی لوگ پورا اتریں گے جو منزِل مقصود تک پہنچے اور ان کے ساتھ جو لوگ وابستہ ہوئے، ان کو ان کے صحیح مقامات تک پہنچایا۔

اسی طرح تمام سالسل کو سمجھ لیجیے۔ اگر کوئی معترض یہ کہے کہ بعض پیر ایسے بھی ہیں جو شریعت کے خالف ہیں، کیا ان کا مذہب بھی حضور نبی کریم صلی الله عليه وآله وسلم تک پہنچتا ہے؟ تو پھر میں یہ کہوں گا کہ ایسے شخص کو جو مخالف شریعت عمل کرتا ہے، اسے پیر کہنا نامناسب ہے اور بیعت بھی حرام ہے۔ ہاں! اولیاء اللہ میں کوئی ایسا دکھاؤ جو مخالف شریعت چل کر منزِل مقصود تک پہنچ گیا ہو، ہرگز نہیں۔

دلیل مذکورہ سے یہ ثابت ہے کہ سوائے کسی شیخ کامل کے ساتھ بیعت کرنے کے کبھی صحیح مذہب کی نشاندہی نہیں ہوسکتی۔ اسی وجہ سے اولیاء اللہ کے ملفوظات اور ان کی زندگیوں کے حالات ہمارے لیے روشنی کا مشعل راہ ہیں کیونکہ مولٰی کریم نے فرمایا:
’’ہم کو سیدھے راستہ پر، راستہ ان کا جن پر تو نے انعام فرمایا (اے الله)‘‘

کہہ کر ہمیں صراِط مسقیم دکھا دی ہے۔ اب ہمیں چاہیے کہ ان لوگوں کی تلاش کریں جن پر انعام ہوئے اور یہ وہ لوگ ہیں جن کا ذکر اللہ تعالٰی نے اس آیِت شریفہ میں فرمایا ہے:
وَالْصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ وَحَسُنَ أُو۟لَـٰٓئِكَ رَفِيقًا

اور جو اطاعت کرتے ہیں الله کی اور اس کے رسول کی تو وہ ان لوگوں کے ساتھ ہوں گے جن پر الله تعالٰی نے انعام فرمایا یعنی انبیاء اور صدیقین اور شہداء اور صالحین اور کیا ہی اچھے ہیں یہ ساتھی۔

یہ دلیل روشن ہے کہ اولیاء اللہ کا مذہب ہمیشہ ‘‘بی ’’ سے واضح ہوتا ہے اور جو بھی اس معیار پر پورا اترتا ہے، وہی مذہب ہے جو ناجی ہے۔

حضرت قبلہ مخدوم پیر سّید محمد عبد الله شاہ صاحب رحمة اهلل عليه کے ملفوظات دیکھنے کے لیے فقیر کو سابقین کے عمل کا نمونہ ملتا ہے۔ آپ کے تمام وعظ گم کردگا کہا گیا۔ فقیر نے بنظ غائر مطالعہ کیا تو ان ملفوظات میں مشائِخ ہدایت کے لیے مشعل راہ کی حیثیت رکھتے ہیں۔ فقیر نے آپ کی بقیہ حیات بھی زیارت کی ہے۔ آپ نے نہایت جانفشانی سے راہ کو ہدایت بخشی، اور اس آفتاب ہدایت نے مؤرخہ 29 جون 1961ء بمطابق 15 محرم الحرام 1381ھ وصال فرمایا۔ اب بھی آپ کا مزار شریف موضع قادر بخش شریف میں مرجع خاص و عام ہے۔

فقیر الی الله ابو الحقائق پیر سّید امانت علی شاہ چشتی نظامی رحمة اهلل عليه، مغلپورہ گنج، لاہور""";
  static const String munqabatLongText = '''
  ہے لب پہ میرے نام بس اب ایسے حسیں کا لے کر جو گیا تھا کبھی دل اہل زمیں کا

آیا تھا ہمیں ایک جھلک اپنی دکھانے مہماں تو تھا یارو مگر عرش بریں کا

ارشاد خداوند ہمیں آکے سنائے متلاشی تھا ہر وقت وہ شاگرد ذہیں کا

کردے جو فراموش اسے کون سا دل ہے اس کا تھا وہ ہوجاتا نہ ہوتا جو کہیں کا

نائب وہ نبی کا تھا، اولاد علی تھا ہر ذرہ غزل خواں ہے اس ماہ جبیں کا

وہ کون تھا اور کیا تھا، بس اتنا ہی سنا ہے
  ''';
}
